Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/cli/gdrive.po
Languages: fr_fr

source: The `drive` CLI is a utility that allows managing the Google Drive account from the SEPAL console, to read the full documentation please refer to the Readme file directly in the GitHub repository https://github.com/odeke-em/drive.
fr_fr: Le CLI :code:`drive` est un utilitaire qui permet de gérer le compte Google Drive à partir de la console SEPAL, pour lire la documentation complète, veuillez vous référer au fichier Readme directement dans le dépôt GitHub https://github.om/odeke-em/drive.

source: Usage
fr_fr: Utilisation

source: Initialize drive connection
fr_fr: Initialiser la connexion à drive

source: Before running any of the drive commands, you have to start a session, to do so, run the following line:
fr_fr: Avant d'exécuter une des commandes de drive, vous devez démarrer une session, pour ce faire, exécutez la ligne suivante :

source: As result, an URL will be displayed in the terminal, visit it by copying and pasting it in your browser. Log-in to your Google account and, "trust the connection" by clicking the "allow" button. An authorization code will be displayed, copy it and paste it into the Sepal terminal. Now you are ready to use the :code:`drive` CLI tool.
fr_fr: Une URL sera affichée dans le terminal, visitez le en le copiant et en le collant dans votre navigateur. Connectez-vous à votre compte Google et, "Faites confiance à la connexion" en cliquant sur le bouton "Autoriser". Un code d'autorisation sera affiché, copié et collé dans le terminal SEPAL. Maintenant vous êtes prêt à utiliser l'outil CLI :code:`drive`.

source: The authorization token will expire on every session, this process has to be repeated each time you want to use the :code:`drive` command tool.
fr_fr: Le jeton d'autorisation expirera à chaque session, ce processus doit être répété chaque fois que vous voulez utiliser l'outil de commande :code:`drive`.

source: Upload files
fr_fr: Envoyer des fichiers

source: You can upload files from your SEPAL environment by using the :code:`push` command.
fr_fr: Vous pouvez télécharger des fichiers depuis votre environnement SEPAL en utilisant la commande :code:`push`.

source: Download files
fr_fr: Télécharger les fichiers

source: To download files, use the :code:`pull` command. This command will create files that doesn't exist locally but does remotely.
fr_fr: Pour télécharger des fichiers, utilisez la commande :code:`pull`. Cette commande va créer des fichiers qui n'existent pas encore localement.

source: This command will syncronize the files that are not present in your sepal session but are present in your Google Drive account folder.
fr_fr: Cette commande synchronisera les fichiers qui ne sont pas présents dans votre session SEPAL, mais sont présents dans le dossier de votre compte Google Drive.

source: Additional commands
fr_fr: Commandes supplémentaires
