Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/cli/r.po
Languages: fr_fr

source: Usage
fr_fr: Utilisation

source: SEPAL instances run on :code:`focal` Ubuntu machines, providing a fully functional :code:`R 4.1.2` environment that is accessible in RStudio, Jupyterlab or the terminal.
fr_fr: Les instances SEPAL fonctionnent sur des machines Ubuntu :code:`focal`, fournissant un environnement :code:`R 4.1.2` entièrement fonctionnel qui est accessible dans RStudio, Jupyterlab ou le terminal.

source: The SEPAL :code:`R` environment is not empty; there are numerous embedded packages.
fr_fr: L'environnement SEPAL :code:`R` n'est pas vide ; il y a de nombreux paquets intégrés.

source: To check the availability of a specific package:
fr_fr: Pour vérifier la disponibilité d'un package spécifique :

source: Open RStudio.
fr_fr: Ouvrir RStudio.

source: Go to :guilabel:`Help` > :guilabel:`R Help` (from the menu above).
fr_fr: Allez dans :guilabel:`Aide` > :guilabel:`Aide R` (à partir du menu ci-dessus).

source: You will see the **Help** panel opened.
fr_fr: Vous verrez le panneau **Aide** ouvert.

source: Select :code:`Reference` > :code:`Packages`
fr_fr: Sélectionnez :code:`Référence` > :code:`Packages`

source: Customization
fr_fr: Personnalisation

source: The SEPAL environment can be customized to user needs by utilizing third-party packages and CRAN in **RStudio**.
fr_fr: L'environnement SEPAL peut être personnalisé en fonction des besoins des utilisateurs en utilisant des paquets tiers et CRAN dans **RStudio**.

source: If you face compatibility issues when customizing your SEPAL environment, contact the SEPAL team in the `Github issue tracker <https://github.com/openforis/sepal/issues/new/choose>`__.
fr_fr: Si vous rencontrez des problèmes de compatibilité lors de la personnalisation de votre environnement SEPAL, contactez l'équipe SEPAL dans le `Github issue tracker <https://github.com/openforis/sepal/issues/new/choose>`__.
