Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/workflows/drivers.po
Languages: fr

source: A total of eight direct drivers were defined by their specific characteristics identifiable in high resolution satellite imagery from Planet.
fr: Un total de huit moteurs directs ont été définis par leurs caractéristiques spécifiques identifiables dans l'imagerie satellite de haute résolution de Planet.

source: Driver
fr: Moteur

source: example
fr: exemple

source: characteristics
fr: caractéristiques

source: Artisanal agriculture
fr: Agriculture artisanale

source: Small-scale agriculture is composed of small, informal, unstructured and irregular agricultural plots covering an area of less than 5ha. The presence of fires (slash-and-burn agriculture) can be observed, and the land is often soil cover in various stages of cultivation.
fr: L'agriculture à petite échelle est composée de petites parcelles agricoles informelles, non structurées et irrégulières couvrant une superficie de moins de 5 ha. On peut souvent observer la présence d'incendies (agriculture à brulis) et la terre est souvent recouverte de sols à diverses étapes de culture.

source: Industrial agriculture
fr: Agriculture Industrielle

source: Industrial agriculture is characterized by agricultural areas larger than 5 ha that tend to be homogeneous and often consist of a single crop. In some cases, agriculture may be more varied and consist of many fields closely packed together. Therefore, large areas consisting of many small fields cultivated at the same time are also considered industrial agriculture under the definition.
fr: L'agriculture industrielle est caractérisée par des zones agricoles de plus de 5 ha qui tendent à être homogènes, composées d'une seule culture. Dans certains cas, l'agriculture peut être plus variée et se composer de nombreux champs étroitement remplis ensemble. Par conséquent, les grandes superficies constituées de nombreux petits champs cultivés en même temps sont également considérées comme une agriculture industrielle dans le cadre de la définition.

source: Roads are visible in the images with linear features and are identified as motorized when they are wide enough (5m) to carry vehicle traffic. Small irregular paths through vegetation are not included. Roads can be large highways, or logging trails, and are most often found with other engines such as villages, mining facilities.
fr: Les routes sont visibles dans les images avec des caractéristiques linéaires et sont identifiées comme motorisées quand elles sont assez larges (5m) pour transporter le trafic automobile. Les petits chemins irréguliers à travers la végétation ne sont pas inclus. Les routes peuvent être de grandes autoroutes, ou des sentiers forestiers, et sont le plus souvent trouvées avec d'autres moteurs tels que les villages, agriculture, les installations minières.

source: Settlements
fr: Villages et Peuplements

source: Villages and settlements can be hard or soft roofed, they can be buildings or huts, and they are often accompanied by roads and other drivers such as small-scale agriculture. This engine can be an urban area (left image), or a small isolated village in a forest stand (right image).
fr: Les villages et les villages peuvent avoir des toits durs ou souples, ils peuvent être des bâtiments ou des cabanes, et ils sont souvent accompagnés par des routes et d'autres moteurs comme l'agriculture à petite échelle. Ce moteur peut être en zone urbaine (image de gauche), ou un petit village isolé dans un stand forestier (image à droite).

source: Artisanal forestry
fr: Foresterie artisanale

source: Small-scale or artisanal logging is characterized by the selective extraction of trees in an irregular manner, leaving a tree cover. These are areas that are not visibly cultivated. These areas are often found in places accessible by small roads or villages.
fr: L'exploitation forestière artisanale ou á petite échelle est caractérisée par l'extraction sélective des arbres de manière irrégulière, laissant une couverture arborée . Il s'agit de zones qui ne sont pas visiblement cultivées, souvent situées dans des endroits accessibles par de petites routes ou villages.

source: Industrial forestry
fr: Foresterie industrielle

source: Large-scale or industrial forestry is recognizable by the presence of logging roads, along which selective logging degradation occurs. These roads may be recent or old, and the canopy can quickly cover them, so all years of imagery acquired over the entire study period are evaluated.
fr: La forestrie à grande échelle ou industrielle est reconnaissable par la présence de routes forestières, le long desquelles se produit une dégradation sélective de l'exploitation forestière. Ces routes peuvent être récentes ou anciennes, et la canopée peut rapidement les couvrir, de sorte que toute la série temporelle d'images acquises au cours de la période d'études sont évaluées.

source: Artisanal mine
fr: Mine artisanale

source: Small-scale mining is characterized by muddy clearings, and usually ponds or water catchments and may feature turbid water. Artisanal in nature, the clearings are generally small, isolated, and often located along streams.
fr: Les mines à petite échelle sont caractérisées par des défrichements boueux, généralement des étangs ou des bassins d’eau et peuvent contenir de l’eau turbide. Artisanal par nature, les dégagements sont généralement petits, isolés et souvent situés le long des ruisseaux.

source: Industrial mine
fr: Mine industrielle

source: Large-scale mining is characterized by large ponds, open pits and clearings, as well as extensive infrastructure and roads.
fr: L'exploitation minière à grande échelle est caractérisée par de grands étangs, des fosses ouvertes et des défrichements, ainsi que par de vastes infrastructures et routes.

source: To address the overlap of drivers in the same location and interpret local context, our approach identifies archetypes, or common driver combinations which represent realities and processes on the ground. The most common archetype consists of four drivers, which include artisanal agriculture, artisanal forestry, roads and settlements, which is representative of the agricultural mosaic, or so-called “rural complex” commonly observed in the region\ :footcite:`molinario:2020`.
fr: Pour traiter le chevauchement des moteurs dans la même zone et interpréter le contexte local, notre approche identifie les archétypes, ou groupements communs de moteurs qui représentent les réalités et les processus sur le terrain. L'archétype le plus commun se compose de quatre moteurs, qui comprennent l'agriculture artisanale, la foresterie artisanale, les routes et les villages, qui est représentatif de la mosaïque agricole, ou ce qu'on appelle le "complexe rural" frequemment observé dans la région\ :footcite:`molinario:2020`.

source: The observed combinations of drivers are grouped into thematic classes or archetypes.
fr: Les combinaisons de moteurs souvent observées ensemble sont organisées en groupes thématiques ou archétypes.

source: Rural complex
fr: Complexe rural

source: Artisanal agriculture with roads and settlements, with or without artisanal forestry, and no industrial drivers
fr: Agriculture artisanale avec routes et villages, avec ou sans foresterie artisanale, et sans moteurs industriels

source: Artisanal forestry with or without “other” driver, or with settlements or roads without any artisanal agriculture
fr: Foresterie artisanale avec ou sans moteur « autre », ou avec des villages, ou des routes sans présence d'agriculture artisanale

source: Industrial Agriculture
fr: Agriculture Industrielle

source: Industrial agriculture and other non-industrial drivers
fr: L'agriculture industrielle et d'autres moteurs non industriels

source: Industrial forestry and other non-industrial drivers
fr: La foresterie industrielle et d'autres moteurs non industriels

source: Industrial Forestry and Agriculture
fr: Foresterie et Agriculture Industrielle

source: Industrial Forestry and Agriculture identified together
fr: Foresterie et Agriculture Industrielle sont présents ensemble

source: Industrial mining
fr: Mine industrielle

source: Presence of industrial mining without other industrial drivers
fr: Présence de mines industrielles sans autres moteurs industriels

source: Artisanal mining
fr: Mine artisanale

source: No more than 2 drivers, including artisanal mining, no industrial drivers present
fr: Pas plus de 2 moteurs, y compris les mines artisanales, aucun moteur industriel présent

source: Human infrastructure
fr: Infrastructures humaines

source: Roads, settlements observed alone or together, no other drivers present
fr: Routes, villages observées seules ou ensemble, aucun autre moteur présent

source: Infrastructure related agriculture
fr: Agriculture liée à l'infrastructure

source: Infrastructure and artisanal agriculture observed together
fr: Les infrastructures et l'agriculture artisanale sont observées ensemble

source: Methodology
fr: Méthodologie

source: The major components of this this methodology include the generation of wall-to-wall geospatial data on forest cover types, changes, and discerning areas of deforestation from degradation for the entire Central African region. Next, these products are validated via visual interpretation and the presence of various direct drivers are identified to evaluate the direct causes of disturbance, and interpreted in the context of strategic investments for climate change mitigation and support for national efforts for emissions reduction.
fr: Les principales composantes de cette méthodologie comprennent la génération de données géospatiales mur à mur sur les types de couverture forestière, les changements et la distinction entre les zones de déforestation et de dégradation pour l'ensemble de la région d'Afrique centrale. Ensuite, ces produits sont validés par une interprétation visuelle et la présence de divers facteurs directs est identifiée pour évaluer les causes directes des perturbations, et interprétée dans le contexte des investissements stratégiques pour l'atténuation du changement climatique et le soutien aux efforts nationaux de réduction des émissions. données géospatiales sur les types de couverture forestière, les changements, et la distinction entre les zones de déforestation et de dégradation pour l'ensemble de la région d'Afrique centrale. Ensuite, ces produits sont validés par une interprétation visuelle et la présence de divers facteurs directs est identifiée pour évaluer les causes directes des perturbations, et interprétée dans le contexte des investissements stratégiques pour l'atténuation du changement climatique et le soutien aux efforts nationaux de réduction des émissions.

source: The methodology uses FAO’s OpenForis suite of tools including the SEPAL platform for satellite data analysis, Collect Earth Online and Google Earth Engine. The approach analyses dense satellite time-series to generate geospatial data on forest changes which are then validated and interpreted for direct drivers in 5 major steps:
fr: La méthodologie utilise la suite d'outils OpenForis de la FAO, y compris la plateforme SEPAL pour l'analyse des données satellitaires, Collect Earth Online et Google Earth Engine. L'approche consiste à analyser des séries temporelles denses de données satellitaires pour générer des données géospatiales sur les changements forestiers, qui sont ensuite validées et interprétées en fonction des facteurs directs en cinq étapes principales :

source: :ref:`workflows:drivers:mosaic`: processing of optical (Landsat 4/5/7/8) and radar (Sentinel 1/ALOS PALSAR) satellite images to create mosaics for the classification of wall-to-wall maps of vegetation types, recoded to a binary forest mask (following national forest definitions), and forest fragmentation assessment for the baseline year 2015
fr: :ref:`workflows:drivers:mosaic` : traitement d'images satellites optiques (Landsat 4/5/7/8) et radar (Sentinel 1/ALOS PALSAR) afin de créer des mosaïques pour la classification de cartes mur à mur des types de végétation, recodées en un masque forestier binaire (suivant les définitions des forêts nationales), et l'évaluation de la fragmentation forestière pour l'année de référence 2015.

source: :ref:`workflows:drivers:series`: processing of optical satellite (Landsat 4/5/7/8) time series data covering 2012-2020 (2012-2015 is the historical time period, monitoring is from 2016-2020), using seasonal models and break detection algorithms to produce a forest change map for 2015-2020 at regional scale identifying areas of both deforestation and degradation.
fr: :ref:`workflows:drivers:series` : traitement de données de séries temporelles de satellites optiques (Landsat 4/5/7/8) couvrant la période 2012-2020 (2012-2015 est la période historique, la surveillance s'étend de 2016 à 2020), en utilisant des modèles saisonniers et des algorithmes de détection des ruptures pour produire une carte des changements forestiers pour 2015-2020 à l'échelle régionale, identifiant les zones de déforestation et de dégradation.

source: :ref:`workflows:drivers:stratification`: Stratified random sampling is conducted on the change map from step 2. Systematic validation for all points identified as change, plus a sample of stable points is conducted in Collect Earth Online, evaluating land cover types, changes and dates of change and the identification of the presence of direct drivers.
fr: :ref:`workflows:drivers:stratification` : Un échantillonnage aléatoire stratifié est réalisé sur la carte des changements à l'étape 2. La validation systématique de tous les points identifiés comme ayant changé, ainsi qu'un échantillon de points stables, est effectuée dans Collect Earth Online, en évaluant les types d'occupation du sol, les changements et les dates de changement, ainsi que l'identification de la présence de facteurs directs.

source: :ref:`workflows:drivers:quantification`: The quantification of direct drivers by forest types, fragmentation class
fr: :ref:`workflows:drivers:quantification` : La quantification des facteurs directs par type de forêt, classe de fragmentation, etc

source: Creating cloud-free mosaics
fr: Création de mosaïques sans nuages

source: To accurately determine disturbances within forest ecosystems and distinguish from other dynamics occurring in non-forest areas, a baseline forest mask is required. This is achieved by classifying cloud-free image mosaics, which are created using the optical and radar mosaic recipes.
fr: Pour déterminer avec précision les perturbations au sein des écosystèmes forestiers et les distinguer d'autres dynamiques se produisant dans des zones non forestières, il est nécessaire de disposer d'un masque forestier de référence. Pour ce faire, on classifie des mosaïques d'images sans nuages, créées à l'aide des recettes de mosaïques optiques et radar.

source: As you can see in this `online animation <https://drive.google.com/file/d/1H5Br82CoE1QJnri0cBl1Pf2tRJV3kW96/view>`__, clouds are persistent in the Congo Basin region. For this reason we will produce mosaics of optical cloud-free imagery, and radar (cloud independent) composites for the best observations of the study region.
fr: Comme vous pouvez le voir dans cette `animation en ligne <https://drive.google.com/file/d/1H5Br82CoE1QJnri0cBl1Pf2tRJV3kW96/view>`__, les nuages sont persistants dans la région du Bassin du Congo. C'est pourquoi nous produirons des mosaïques d'images optiques sans nuages et des composites radar (non affectés par les nuages) pour les meilleures observations de la région étudiée.

source: Optical cloud-free composite
fr: Mosaïque optique sans nuages

source: Multi-temporal image mosaics are compiled from data collected over several months or years. Cloud-free pixels from multiple images are integrated into an image with fewer clouds, haze and shadows using the pixel quality band provided with image metadata.
fr: Les mosaïques d'images multitemporelles sont compilées à partir de données collectées sur plusieurs mois ou années. Les pixels sans nuages provenant de plusieurs images sont intégrés dans une image avec un minimum de nuages, de brume et d'ombres en utilisant la bande de qualité des pixels fournie avec les métadonnées de l'image.

source: We evaluated the availability of Landsat 4,5,7 and 8 images for the creation of optical mosaics for the baseline year or 2015. As you can see from the figure below, only certain sensors are available for certain time periods – from 2003 onwards the Landsat 7 sensor experienced a malfunction which results in data gaps in strips. This sensor should be only included when necessary, i.e. when not enough imagery is available. Luckily in SEPAL the selection of sensors is automatic based on the selected date and only provides the available options.
fr: Nous avons évalué la disponibilité des images Landsat 4, 5, 7 et 8 pour la création de mosaïques optiques pour l'année de référence 2015. Comme vous pouvez le voir sur la figure ci-dessous, seuls certains capteurs sont disponibles pour certaines périodes - à partir de 2003, le capteur Landsat 7 a connu un dysfonctionnement qui a entraîné des lacunes dans les données des bandes. Ce capteur ne devrait être utilisé qu'en cas de nécessité, c'est-à-dire lorsqu'il n'y a pas assez d'images disponibles. Heureusement, dans SEPAL, la sélection des capteurs est automatique en fonction de la date sélectionnée et ne propose que les options disponibles.

source: The coverage of Landsat over time is shown below. The western part of the study region along the coast, results in cloudy or data gaps in Gabon, Equatorial Guinea and Cameroon.
fr: La couverture de Landsat dans le temps est présentée ci-dessous. La partie occidentale de la région étudiée, le long de la côte, se traduit par des nuages ou des lacunes dans les données au Gabon, en Guinée équatoriale et au Cameroun.

source: To create our optical mosaic, we will use the SEPAL optical mosaic recipe. To learn more about the different available parameters and how to use the recipe, please see :doc:`../cookbook/optical_mosaic`.
fr: Pour créer notre mosaïque optique, nous utiliserons la recette de mosaïque optique SEPAL. Pour en savoir plus sur les différents paramètres disponibles et sur l'utilisation de la recette, veuillez consulter :doc:`../cookbook/optical_mosaic`.

source: In this example we will use a custom asset from GEE for the :btn:`AOI` parameter: :code:`projects/cafi_fao_congo/aoi/cafi_countries_buffer_simple`. It includes an ISO column to select Congo Basin countries according to their three digit code. See :doc:`../feature/aoi_selector` for more AOI selection methods.
fr: Dans cet exemple, nous utiliserons une ressource personnalisée de GEE pour le paramètre :btn:`AOI` : :code:`projects/cafi_fao_congo/aoi/cafi_countries_buffer_simple`. Il inclut une colonne ISO pour sélectionner les pays du Bassin du Congo selon leur code à trois caractères. Voir :doc:`../feature/aoi_selector` pour plus de méthodes de sélection AOI.

source: In the :btn:`DAT` section you can select the dates of interest.
fr: Dans la section :btn:`DAT', vous pouvez sélectionner les dates qui vous intéressent.

source: For later years (after 2018), the sensor coverage is good so you can safely select all images of a single year.
fr: Pour les années ultérieures (après 2018), la couverture du capteur est bonne et vous pouvez donc sélectionner en toute sécurité toutes les images d'une seule année.

source: For earlier eras, e.g. 2015 use the advanced option to add images from prior years from a targeted season (in this case the full year). This will help to fill the gaps in cloudy areas.
fr: Pour les époques antérieures, par exemple 2015, utilisez l'option avancée pour ajouter des images des années précédentes d'une saison ciblée (dans ce cas, l'année entière). Cela permettra de combler les lacunes dans les zones nuageuses.

source: For data sources, more is generally better. Select all Landsat options for a consistent mosaic. If you like, Sentinel-2 can be added for more data, but as the tiling system of the 2 sensors are different you will be forced to use all available images - the option to select images will not be available.
fr: Pour les sources de données, plus il y en a, mieux c'est. Sélectionnez toutes les options Landsat pour obtenir une mosaïque cohérente. Si vous le souhaitez, vous pouvez ajouter Sentinel-2 pour obtenir plus de données, mais comme le système de mosaïque des deux capteurs est différent, vous serez obligé d'utiliser toutes les images disponibles - l'option de sélection des images ne sera pas disponible.

source: If you are only working with Landsat (or only with Sentinel), you can manually select scenes if you want to tailor your mosaic and you have a lot of time to devote to your mosaic. :btn:`USE ALL SCENES` is the quicker and simpler approach and recommended for large areas.
fr: Si vous ne travaillez qu'avec Landsat (ou seulement avec Sentinel), vous pouvez sélectionner manuellement des scènes si vous voulez adapter votre mosaïque et vous avez beaucoup de temps à consacrer à votre mosaïque. :btn:`UTILISEZ TOUS LES SCENES` est l'approche la plus rapide et la plus simple et recommandée pour de grandes surfaces.

source: For the composite options we recommend :btn:`SR` and :btn:`BRDF`, you can exclude pixels with low NDVI (particularly if you have a long time period) and select the following options:
fr: Pour les options composites, nous recommandons :btn:`SR` et :btn:`BRDF`, vous pouvez exclure les pixels à faible NDVI (en particulier si vous avez une longue période de temps) et sélectionner les options suivantes :

source: You can then retrieve the mosaic as a Google asset at 30m resolution. We select the original bands as all other indices can be recalculated later: :btn:`BLUE`, :btn:`GREEN`, :btn:`RED`, :btn:`NIR`, :btn:`SWIR1`, :btn:`SWIR2`, :btn:`THERMAL`
fr: Vous pouvez ensuite récupérer la mosaïque en tant que ressource Google à une résolution de 30 m. Nous sélectionnons les bandes originales car tous les autres indices peuvent être recalculés ultérieurement. Nous sélectionnons les bandes originales car tous les autres indices peuvent être recalculés ultérieurement : :btn:`BLUE`, :btn:`GREEN`, :btn:`RED`, :btn:`NIR`, :btn:`SWIR1`, :btn:`SWIR2`, :btn:`THERMAL`

source: Once the export is finished, you can view the asset in Google Earth Engine or SEPAL. Here is the 2015 mosaic of the Congo Basin using the above parameters:
fr: Une fois l'export est terminé, vous pouvez visualiser l'asset dans Google Earth Engine ou SEPAL. Voici la mosaïque 2015 du Bassin du Congo en utilisant les paramètres ci-dessus :

source: ALOS Palsar mosaics
fr: Mosaïques ALOS Palsar

source: Radar imagery has the added benefit of being cloud-free by design as active sensors are not influenced by clouds.
fr: L'imagerie radar présente l'avantage supplémentaire d'être exempte de nuages, car les capteurs actifs ne sont pas affectés par les nuages.

source: Alos Palsar is a L-band radar that gives good results for monitoring forest ecosystems. Data is provided by the Kyoto & Carbon Initiative from the Japanese Space Agency (JAXA) for the year 2015 onward. SEPAL provides an application to select, process and download them to your user space pr Google Earth Engine Account.
fr: Alos Palsar est un radar en bande L qui donne de bons résultats pour la surveillance des écosystèmes forestiers. Les données sont fournies par l'Initiative Kyoto & Carbone de l'Agence spatiale japonaise (JAXA) pour l'année 2015 et les suivantes. SEPAL fournit une application pour les sélectionner, les traiter et les télécharger sur votre espace utilisateur ou votre compte Google Earth Engine.
