Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/workflows/drivers.po
Languages: fr

source: For more information about the parameters, Please see :doc:`../modules/dwn/alos_mosaics`.
fr: Pour plus d'informations sur les paramètres, veuillez consulter :doc:`../modules/dwn/alos_mosaics`.

source: Sentinel-1 mosaics
fr: Mosaïques Sentinel-1

source: You can use the Sentinel-1 recipe to create a mosaic from ESA Copernicus radar data.
fr: Vous pouvez utiliser la recette de mosaïque radar pour créer une mosaïque à partir des données radar de l'ESA Copernicus.

source: The aoi selection is the same as for the optical mosaic. For the dates you can enter a year, a date range, or a single date. When you add a year or date range, SEPAL will provide a “time-scan” composite which includes bands which are statistical metrics of the range of data including phase and amplitude which assess the phenology and variations within the time period.
fr: La sélection de l'aoi est la même que pour la mosaïque optique. Pour les dates, vous pouvez saisir une année, une plage de dates ou une date unique. Lorsque vous ajoutez une année ou une plage de dates, SEPAL fournit un composite "time-scan" qui comprend des bandes qui sont des mesures statistiques de la plage de données, y compris la phase et l'amplitude qui évaluent la phénologie et les variations au sein de la période de temps.

source: For the best results in the Congo Basin the following parameters are proposed:
fr: Pour les meilleurs résultats dans le bassin du Congo, les paramètres suivants sont proposés :

source: Both :btn:`ascending` and :btn:`descending` orbits will ensure complete coverage of the AOI
fr: Les orbites :btn:`ascendant` et :btn:`descendant` assureront une couverture complète de la zone d'intérêt

source: The :btn:`terrain` correction will mask any errors due to topography, or terrain “shadows”
fr: La correction géométrique :btn:'relief' masquera toutes les erreurs des « ombres » dues à la topographie

source: We don’t need to apply a speckle filter
fr: Nous n'avons pas besoin d'appliquer un filtre

source: :btn:`moderate` outlier removal will provide the most consistent results
fr: :btn:`modérée` fournira les résultats les plus cohérents

source: Select which bands to export in the retrieve window, you may select all of them depending on the space available in your GEE repository or SEPAL workspace. Resolution can also be selected accordingly - you can choose :btn:`30` to be at the same scale as the optical mosaic, which will be classified in the next step.
fr: Sélectionnez les bandes à exporter dans l'onglet récupération, vous pouvez sélectionner toutes les bandes en fonction de l'espace disponible dans votre référentiel GEE ou dans votre espace de travail SEPAL. La résolution peut également être sélectionnée en conséquence - vous pouvez choisir :btn:`30` pour rester à la même échelle que la mosaïque optique, qui seront classés à l'étape suivante.

source: Time-series analysis
fr: Analyse des séries temporelles

source: This part of the documentation is still under construction.
fr: Cette partie de la documentation est encore en cours de construction.

source: Sample Stratification
fr: Stratification et échantillonnage
