Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/workflows/drivers.po
Languages: fr

source: Direct Drivers Assessment
fr: Évaluation des facteurs directs de déforestation et dégradation

source: This documentation has been produced in the framework of the global project entitled: Assessment of deforestation and forest degradation and related direct drivers using SEPAL, supported by the Central African Forest Initiative `(CAFI) <https://cafi.org>`__. This project, known as the Deforestation and Degradation Drivers (DDD) project is a global methodology developed and piloted in the Central African region. The Congo Basin area is used as an example but this methodology can be applied to any other geographic area.
fr: Cette documentation a été produite dans le cadre du projet global intitulé : Estimation de la déforestation et de la dégradation des forêts et des facteurs directs actuels et historiques associés à ces processus à l’aide de SEPAL, financé par l'Initiative pour la forêt de l'Afrique Centrale `(CAFI) <https://cafi.org>`__. Ce projet, connu sous le nom de projet CAFIDDD, est une méthodologie globale développée et pilotée dans la région d’Afrique centrale. La zone du bassin du Congo est utilisée comme exemple mais cette méthodologie peut être appliquée à toute autre zone géographique.

source: Background
fr: Contexte

source: Deforestation and forest degradation (DD) are complex processes that have many underlying causes. A comprehensive understanding of forest conversion to other land uses is instrumental for the development of policies and actions aiming to reduce the loss of forests and its associated carbon emission. It is important to understand recurring patterns and correlations that can help countries tailor their efforts towards reducing forest loss. The causes of deforestation and forest degradation vary both regionally and temporally\ :footcite:`curtis:2018`. Different studies refer to agricultural expansion (cropland and pasture) as the largest direct cause of global deforestation\ :footcite:`fra:2022,gibbs:2010,hosonuma:2012,kissinger:2012,sandker:2017`. Commercial agriculture is estimated to be responsible for around 70-90% of the worldwide deforestation, while in Africa, both commercial and subsistence agriculture may account for similar importance in terms of forest loss, while fuel wood collection, charcoal production, and, to a lesser extent, livestock grazing in forests are the most important drivers of degradation.
fr: La déforestation et la dégradation des forêts (DD) sont des processus complexes qui ont de nombreuses causes sous-jacentes. Une compréhension globale de la conversion des forêts en d’autres utilisations de la terre est essentielle au développement de politiques et d’actions visant à réduire la perte de forêts et les émissions de carbone qui y sont associées. Il est important de comprendre les modèles récurrents et les corrélations qui peuvent aider les pays à adapter leurs efforts pour réduire la perte de forêts. Les causes de la déforestation et de la dégradation des forêts varient à la fois sur le plan régional et temporelle\ :footcite:`curtis:2018`. Différentes études font référence à l'expansion agricole (culture et pâturage) comme la plus grande cause directe de la déforestation mondiale\ :footcite:`fra:2022,gibbs:2010,hosonuma:2012,kissinger:2012,sandker:2017`.On estime que l'agriculture industrielle est responsable d'environ 70 à 90 % de la déforestation mondiale. En Afrique, l'agriculture industrielle et l'agriculture de subsistance peuvent avoir une importance similaire en termes de perte de forêts. En effet, la collecte de bois de chauffage, la production de charbon de bois et, dans une moindre mesure, le pâturage du bétail dans les forêts sont les principaux moteurs de la dégradation.

source: However, these studies (as well as existing national studies on the drivers of deforestation and forest degradation in the Central African region) are generally based on data acquired up to 2014 and do not consider the recent trends in observed tree cover loss. They also do not take into account the importance of the spatial fragmentation of forests and the role played by degradation induced by forest exploitation :footcite:`molinario:2015`. Furthermore, they simplify causes of deforestation into a single driver, which does not adequately reflect the complex local context and interacting causes, decisions that lead to anthropogenic forest disturbance at local scales :footcite:`ferrer-velasco:2020`.
fr: Cependant, ces études (ainsi que les études nationales existantes sur les moteurs de la déforestation et de la dégradation des forêts dans la région d'Afrique centrale) sont généralement basées sur des données acquises avant 2014 et ne tiennent pas compte des tendances récentes de la perte de couverture forestière. Ils ne tiennent pas non plus compte de l'importance de la fragmentation spatiale des forêts et du rôle joué par la dégradation induite par l'exploitation forestière :footcite:`molinario:2015`. En outre, elles simplifient les causes de la déforestation en un seul moteur, ce qui ne reflète pas de manière adéquate le contexte local complexe et les causes d'interaction, décisions qui conduisent à des perturbations anthropiques de la forêt à l'échelle locale :footcite:`ferrer-velasco:2020`.

source: These recent trends and the lack of updated studies result in little consensus on the main drivers and agents of forest change at regional scales. There is a pressing need to systematically quantify the direct causes of deforestation and degradation via a systematic and comprehensive approach. An updated assessment should provide validated evidence on the role and weight of different drivers of forest loss and support decision making to address related challenges. A spatially explicit approach should also facilitate the assessment of the efficiency of policies and actions in different contexts. Improved spatial data on deforestation and forest degradation, and an improved understanding of the drivers will support land use planning approaches in two pilot areas where the regional analysis indicated clear opportunity for supporting land use decision making and planning.
fr: Ces tendances récentes et le manque d'études actualisées font qu'il n'y a guère de consensus sur les principaux moteurs et agents du changement forestier à l'échelle régionale. Il est urgent de quantifier systématiquement les causes directes de la déforestation et de la dégradation au moyen d'une approche systématique et globale. Une évaluation actualisée devrait fournir des preuves validées sur le rôle et le poids des différents facteurs de déforestation de dégradation et soutenir la prise de décision pour relever les défis qui en découlent. Une approche spatialement explicite devrait également faciliter l'évaluation de l'efficacité des politiques et des actions dans différents contextes. L'amélioration des données spatiales sur la déforestation et la dégradation des forêts, ainsi qu'une meilleure compréhension des facteurs, soutiendront les approches de planification de l'utilisation des terres dans deux zones pilotes où l'analyse régionale a indiqué une opportunité claire de soutenir la prise de décision et la planification de l'utilisation des terres.

source: In this context, FAO has developed a robust methodology to assess the recent trends and drivers of deforestation and forest degradation via collaborative approaches in which national experts, research institutes and civil society work together and join resources and data to reach a common view on the current and future causes and drivers of anthropogenic forest disturbances. These tools generate improved information for decision making and land use planning in the relevant management context.
fr: Dans ce contexte, La FAO a développé une méthodologie robuste pour évaluer les tendances et les moteurs récents de la déforestation et de la dégradation des forêts. Ceci est executé par le biais d'approches collaboratives dans lesquelles les experts nationaux les instituts de recherche et la société civile travaillent ensemble et unissent leurs ressources et leurs données pour atteindre une vision commune des causes actuelles et futures et des facteurs des perturbations anthropiques des forêts. Ces outils génèrent des informations améliorées pour la prise de décisions et l'aménagement du territoire dans le contexte de gestion pertinent.

source: The FAO, in partnership with the Central African Forest Initiative (CAFI), and a coalition of donor and partner countries have developed a global, standard, large-scale methodology to assess forest dynamics using cloud-computing solutions and open-source tools. The approach maps disturbances (both deforestation and degradation) and quantifies the contribution of multiple associated direct drivers. The methodology is used to assess deforestation and forest degradation trends and their associated current and historical direct drivers in six Central Africa countries as part of an international effort to mitigate climate change, support sustainable development goals, and protect biodiversity. The project builds on a collaborative approach, in which national experts, global research institutes and civil society work together, join resources and data to provide technical evidence and reach a common view on the current and historical trends, and direct drivers of forest disturbances.
fr: La FAO, en partenariat avec l'Initiative pour la Forêt d'Afrique Centrale (CAFI), une coalition de pays donateurs et partenaires ont développé un plan mondial, ont développé une méthodologie standard et à grande échelle pour évaluer la dynamique forestière à l’aide de solutions d’informatique dans "le cloud" et d’outils open-source. L'approche évalue les perturbations (déforestation et dégradation) et quantifie la contribution de multiples moteurs directs associés. La méthodologie est utilisée pour évaluer les tendances de la déforestation et de la dégradation des forêts et leurs moteurs directs actuels et historiques associés dans six pays d'Afrique centrale dans le cadre d'un effort international visant à atténuer le changement climatique. soutenir les objectifs de développement durable et protéger la biodiversité. Le projet repose sur une approche collaborative, dans laquelle les experts nationaux, les instituts de recherche mondiaux et la société civile collaborent unir ressources et données pour fournir des preuves techniques et atteindre un point de vue commun sur les tendances actuelles et historiques, et les facteurs directs des perturbations forestières.

source: A robust methodology uses consistent definitions. The following terms and definitions are applied throughout the workflow.
fr: Une méthodologie robuste utilise des définitions cohérentes. Les termes et définitions suivants sont appliqués tout au long du workflow.

source: Area of interest
fr: Zone de l'étude

source: The pilot study area includes the national boundaries of the six Congo Basin countries: Cameroun, Central African Republic, Equatorial Guinea, Gabon, Republic of Congo and the Democratic Republic of the Congo.
fr: La zone d'étude pilote comprend les frontières nationales des six pays du Bassin du Congo : Cameroun, République centrafricaine, Guinée équatoriale, Gabon, République du Congo et République démocratique du Congo.

source: Because of consistency issues between border datasets, at national / regional / global levels, it was decided to take one global dataset, `Large Scale International Boundaries (LSIB), from the U.S. Department of State <https://geonode.state.gov/layers/geonode%3ALSIB>`__.
fr: En raison de problèmes de cohérence entre les données frontalières aux niveaux national / régional / mondial, il a été décidé de prendre un jeu de données global, `Large Scale International Boundaries (LSIB), from the U.S. Department of State <https://geonode.state.gov/layers/geonode%3ALSIB>`__.

source: Forest definitions
fr: Définitions des forêts

source: There are a total of four different national forest definitions in the six countries of the study region. These are applied at country level using information on canopy height, tree cover and pixel area.
fr: Il existe au total quatre définitions forestières nationales différentes dans les six pays de la région de l'étude. Celles-ci sont appliquées au niveau du pays en utilisant des informations sur la hauteur de la canopée, la couverture arborée et la taille des pixels.

source: Scale
fr: Échelle

source: MMU (ha)
fr: Unité Cartographique Minimale (ha)

source: Tree height (m)
fr: Hauteur des arbres (m)

source: Canopy cover (%)
fr: Couverture arborée (%)

source: Comment
fr: Commentaires

source: Cameroon
fr: Cameroun

source: REDD+ National Strategy (MINEP, 2008)
fr: Stratégie nationale REDD+ (MINEP, 2008)

source: Exclusion of monospecific agro-industrial plantations with a purely economic vocation and using mainly agricultural management techniques. Are always considered as forest the areas subjected to natural disturbances which are likely to recover their past status.
fr: Exclusion des plantations agro-industrielles monospécifiques à utilisation purement économique et appliquant principalement des techniques de gestion agricole. Ce sont toujours considérés comme la forêt les zones soumises à des perturbations naturelles qui sont susceptibles de retrouver leur statut passé.

source: Central African Republic
fr: République centrafricaine

source: Functional definition used by national monitoring system (AGEOS)
fr: Définition fonctionnelle utilisée par le système national de surveillance (AGEOS)

source: Democratic Republic of Congo
fr: République démocratique du Congo

source: FREL 2018 (Ministère de l’Environnement et Développemnt Durable, 2018)
fr: FREL 2018 (Ministère de l’Environnement et Développement Durable, 2018)

source: A canopy cover criterion of around 50% for an area of 0.09 ha was used during the interpretation of the samples.
fr: Un critère de couverture de canopée d'environ 50% pour une superficie de 0,09 ha a été utilisé lors de l'interprétation des échantillons.

source: Republic of Congo
fr: République du Congo

source: Exclusion of agricultural activities, in particular palm groves in production.
fr: Exclusion des activités agricoles, en particulier des palmiers en production.

source: Regional Land Cover
fr: Couverture du sol régionale

source: The baseline map for the regional forest cover was first derived from a common classification system that was validated by the project technical committee and included land cover classes reference in national system. The land cover classification has also been published in the `FAO Land Cover Registry <https://www.fao.org/hih-geospatial-platform/resources/projects/land-cover-legend-registry/en>`__.
fr: La carte de base pour la cartographie de couvert forestier régional a d'abord été dérivée d'un système de classification commun qui a été validé par le comité technique du projet et inclus les classes du système national. La classification de la couverture du sol a également été publiée dans le `Registre de couverture terrestre de la FAO <https://www.fao.org/hih-geospatial-platform/resources/projects/land-cover-legend-registry/en>`__.

source: In Central African Republic and Cameroun, shrub savannas were identified as forest, in adherence to the national forest definitions of >10% tree cover
fr: En République centrafricaine et au Cameroun, les savanes d'arbustes ont été identifiées comme forêts, conformément aux définitions forestières nationales de > 10% de couverture arborée

source: Forest/non-Forest
fr: Forêt/non-Forêt

source: English
fr: Anglais

source: French
fr: Français

source: Spanish
fr: Espagnol

source: Forest
fr: Forêt

source: Dense humid primary evergreen forest on terra firme, >60% tree cover
fr: Forêt dense, humide et feuilles persistantes sur terre ferme, >60% couvert d'arbres

source: Dense dry forest, >60% tree cover, with dry seasons
fr: Forêt sèche dense, couverture arborée >60% avec saisons sèches

source: Forêt Secondaire
fr: Bosque denso seco

source: Open forest, 30-60% tree cover, degraded or secondary
fr: Forêt à canopée ouverte, 30 à 60 % de couverture arborée, dégradée ou secondaire

source: Dry open forest, 30-60% tree cover, with dry seasons
fr: Forêt sèche ouverte, 30 à 60 % de couverture arborée, avec saisons sèches

source: Forest >30% tree cover, 1100-1750m altitude
fr: Forêt >30% couverture arborée >1750 m d'altitude

source: Forest >30% tree cover >1750m altitude
fr: Forêt >30% couverture arborée >1750 m d'altitude

source: Forest >30% tree cover on saline waterlogged soils
fr: Forêt >30% de couverture arborée, sur les sols salins humides

source: Swamp mixed foret, >30% tree cover, flooded > 9 months
fr: Forêt marécageuse, couverture arborée > 30%, inondé > 9 mois

source: Riparian forest in valleys or along river edges
fr: Forêt riparienne dans les vallées ou le long des bords de la rivière

source: Tree cover >15%, cultivated or managed
fr: Couverture arborée >15%, cultivée ou sous gestion

source: Woodland savanna 15-30%, tree cover > national forest definition
fr: Savane arborée 15-30%, couverture des arbres > définition nationale forêstière

source: Forest*
fr: Forêt*

source: Shrubland savanna >15% shrub cover > national forest definition
fr: Savane arbustive, >15-%, couverture d'arbustes, > définition nationale forestière

source: Non-Forest
fr: Non-Forêt

source: Grassland savanna <15% tree cover
fr: Savane herbeuse <15% de couverture arborée

source: Aquatic grassland
fr: Herbaceous Savanna

source: <15% vegetation cover
fr: Couverture végétale de <15%

source: Cultivated vegetation >15% vegetation cover
fr: Végétation cultivée >15% de couverture végétale

source: Human dominated and artificial surfaces
fr: Surfaces artificielles

source: Water > 50%
fr: Eau > 50%

source: Shrubland savanna >15% tree cover < national forest definition
fr: Savane arbustive, >15-%, couverture d'arbustes, < définition nationale forestière

source: Definitions of deforestation and degradation
fr: Définitions de déforestation et de dégradation

source: In order to properly discern between deforestation and degradation, we require specific and operational definitions that can be identified from satellite image analysis.
fr: Afin de bien discerner entre la déforestation et la dégradation, nous avons besoin de définitions spécifiques et opérationnelles qui puissent être identifiées à partir de l'analyse des images satellites.

source: Deforestation
fr: Déforestation

source: Degradation
fr: Dégradation

source: Permanent reduction of forest cover below the forest definition
fr: Réduction permanente du couvert forestier en dessous de la définition de la forêt

source: A temporary or permanent reduction of forest cover that remains above the forest definition
fr: Une réduction temporaire ou permanente du couvert forestier qui reste au-dessus de la définition de la forêt

source: **Conversion of forest** to other land use: agriculture, pasture, mineral exploitation, development, etc...
fr: **Conversion de forêt** à une autre utilisation des terres : agriculture, pâturage, exploitation minière, développement, etc...

source: Includes areas where timber is exploited, or trees removes and where forest may be expected to regenerate naturally or with silvicultural methods.
fr: Inclut les zones où le bois est exploité ou où les arbres sont enlevés et où la forêt peut être appelée à se régénérer naturellement ou avec des méthodes sylvicoles.

source: Excludes areas of planned deforestation, such as timber extraction, or in areas where the forest is expected to regenerate naturally or with silvicultural methods.
fr: Exclut les zones de déforestation planifiée, comme l'extraction de bois, ou dans les zones où la forêt est censée se régénérer naturellement ou avec des méthodes sylvicoles.

source: Includes areas where impacts, over exploitation or environmental conditions prohibit regeneration above the forest cover definition
fr: Inclut les zones où les impacts, la surexploitation ou les conditions environnementales empêchent la régénération au-dessus de la définition du couvert forestier

source: Example of deforestation
fr: Exemple de déforestation

source: Deforestation is recognizable in images by a permanent change in forest cover. In high-resolution images, we can often see bare ground, felled trees, and sometimes the beginning of agricultural or other driving activities.
fr: La déforestation est reconnaissable en images par un changement permanent de couverture forestière. Dans les images à haute résolution, nous pouvons souvent voir des sols nus, des arbres abattus et parfois le début des activités agricoles ou d'autres facteurs.

source: Example of degradation
fr: Exemple de dégradation

source: Degradation is more difficult to determine because changes are more subtle, sometimes a few trees removed, and the tree cover remains above the national definition. It is therefore necessary to look at the whole time series and make sure that the changes are not deforestation. Degradation is also not the same everywhere and will differ by forest type and environmental and human context.
fr: La dégradation est plus difficile à déterminer parce que les changements sont plus subtils, parfois quelques arbres abatus, et la couverture arborée reste au-dessus de la définition nationale. Il est donc nécessaire d'examiner toute la série temporelle et de veiller à ce que les changements ne soient pas finalement de la déforestation. La dégradation n'est pas non plus la même partout et elle sera différente par type de forêt et par contexte environnemental et humain.

source: Date convention
fr: Convention de dates

source: The time period for this pilot study is 2015-2022, with an assessment of changes encompassing 31/12/2015 to 31/12/2022. The year 2015 was used as the baseline, with the detection of annual changes in deforestation and degradation starting in 2016 through 2022. This fits with the availability of Sentinel satellite imagery in 2015 (although incomplete for that year), as well as new monthly high-resolution mosaics available for the tropics from Planet, which are available from 2015 and are used for additional validation.
fr: La période pour cette étude pilote est de 2015-2022, avec une évaluation des changements qui englobent le 31/12/2015 à 31/12/2022. L'année 2015 a été utilisée comme ligne de base, avec la détection de changements annuels dans la déforestation et la dégradation à partir de 2016 à 2022. Cela correspond à la disponibilité de l'imagerie Sentinels en 2015 (bien que incomplète pour cette année), ainsi que de nouvelles mosaïques mensuelles à haute résolution disponibles pour les tropiques de Planet, qui sont disponibles à partir de 2015 et sont utilisées pour une validation supplémentaire.

source: The following date convention was adopted:
fr: Cette convention de date a été adoptée :

source: A product for the year YYYY is considered as of 31/12/YYYY.
fr: Un produit pour l'année YYYY est considéré comme le 31/12/YYYY.

source: This convention allows a consistent approach to assessing change products. A change map from year1 to year2 will be consistent with both year1 and year2 maps. The status of the year takes into account any changes that occurred during the year.
fr: Cette convention permet une approche cohérente pour évaluer les produits de changement. Une carte de changement de l'année 1 à l'année 2 sera compatible avec les cartes de l'année 1 et 2. Le statut de l'année tient compte des changements survenus au cours de l'année.

source: Direct Driver definitions
fr: Définitions de Moteurs Direct
