Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/setup/gee.po
Languages: fr_fr

source: Use Google Earth Engine (GEE) with SEPAL
fr_fr: Utiliser Google Earth Engine (GEE) avec SEPAL

source: Sign up for a GEE account and connect with SEPAL
fr_fr: Créez un compte GEE et connectez-vous avec SEPAL

source: In this article, you can learn how to:
fr_fr: Dans cet article, vous pouvez apprendre à :

source: Set up your GEE account
fr_fr: Configurez votre compte GEE

source: Connect your GEE account and SEPAL account
fr_fr: Connectez votre compte GEE et votre compte SEPAL

source: Upload files to GEE
fr_fr: Télécharger des fichiers vers GEE

source: Use GEE assets in SEPAL
fr_fr: Utiliser les assets GEE dans SEPAL

source: GEE and SEPAL
fr_fr: GEE et SEPAL

source: SEPAL is closely linked to GEE, a Google-powered Earth-observation cloud-computing platform. SEPAL can access data stored in the GEE data catalog, use GEE for processing large datasets, and read and write data to GEE assets. A large part of SEPAL's existing code is based on the JavaScript GEE application programming interface (API).
fr_fr: SEPAL est étroitement liée à GEE, une plateforme d’observation de la Terre de Google. SEPAL peut accéder aux données stockées dans le catalogue de données GEE, utiliser GEE pour traiter les grands ensembles de données et lire et écrire des données sur les assets GEE. Une grande partie du code existant de SEPAL est basée sur l'interface de programmation d'applications JavaScript GEE (API).

source: All SEPAL recipes are based on GEE and run scripts written by SEPAL team members to enable access to state-of-the-art processing algorithms without having to write code. In the SEPAL **Applications** list, the applications tagged with the Google logo (:icon:`fa-brands fa-google`) are also running with the Python GEE API and don't require you to use big instances to run complex operations.
fr_fr: Toutes les recettes SEPAL sont basées sur GEE et exécutent des scripts écrits par les membres de l'équipe SEPAL pour permettre l'accès à des algorithmes de traitement à la pointe de la technologie sans avoir à écrire du code. Dans la liste des **Applications** SEPAL les applications taggées avec le logo Google (:icon:`fa-brands fa-google`) fonctionnent également avec l'API Python GEE et ne vous obligent pas à utiliser de grandes instances pour exécuter des opérations complexes.

source: SEPAL recipes can be run from the main SEPAL interface using default SEPAL credentials or your personal GEE access credentials; however, to run the SEPAL applications that employ GEE, you will need to link your SEPAL and GEE accounts. SEPAL applications that make use of GEE will not run (i.e. authentication will not work) if your GEE and SEPAL accounts are unlinked.
fr_fr: Les recettes SEPAL peuvent être exécutées à partir de l'interface SEPAL principale en utilisant les identifiants SEPAL par défaut ou vos identifiants d'accès GEE personnels ; Cependant, pour exécuter les applications SEPAL qui emploient GEE, vous devrez lier vos comptes SEPAL et GEE. Les applications SEPAL qui utilisent GEE ne fonctionneront pas (c'est-à-dire que l'authentification ne fonctionnera pas) si vos comptes GEE et SEPAL sont déconnectés.

source: Sign up
fr_fr: S'inscrire

source: A GEE account is required to properly export images and data products as GEE assets or SEPAL applications using GEE from the SEPAL interface. A Google account is required to sign up for GEE.
fr_fr: Un compte GEE est requis pour exporter correctement des images et des produits de données comme des assets GEE ou des applications SEPAL à l'aide de GEE à partir de l'interface SEPAL. Un compte Google est requis pour vous inscrire à GEE.

source: To sign up for a Google account, go to https://accounts.google.com/servicelogin.
fr_fr: Pour vous inscrire à un compte Google, allez sur https://accounts.google.com/servicelogin.

source: To request a GEE account, go to https://earthengine.google.com/new_signup/.
fr_fr: Pour demander un compte GEE, allez sur https://earthengine.google.com/new_signup/.

source: For first-time users of SEPAL, you will want to select 'Use Without a Cloud Project' as this is how non-commercial users of GEE should begin. The link between GEE and Google Cloud Projects (GCP) is evolving and SEPAL will continue to develop in order to make use of GCP correctly. For now, though...use SEPAL without a GCP.
fr_fr: Pour les nouveaux utilisateurs de SEPAL, vous devrez sélectionner 'Utiliser sans projet cloud' car c'est ainsi que les utilisateurs non commerciaux de GEE devraient commencer. Le lien entre les projets GEE et Google Cloud (GCP) évolue et SEPAL continuera à se développer afin de pouvoir utiliser correctement GCP. Cependant, pour l'instant, utiliser SEPAL sans GCP.

source: Once you have a GEE account, go to https://code.earthengine.google.com/ to access the **Earth Engine Code Editor**.
fr_fr: Une fois que vous avez un compte GEE, allez sur https://code.earthengine.google.com/ pour accéder à **L'éditeur de code Part Engine**.

source: When you first connect to the **Earth Engine Code Editor**, it is strongly advised to take the short tour provided in the interface.
fr_fr: Lorsque vous vous connectez pour la première fois à **l'Éditeur de Code de Earth Engine**, il est fortement recommandé de prendre la courte visite fournie dans l'interface.

source: If you experience trouble while linking your Google account to GEE, contact the SEPAL team at :email:`sepal@fao.org`.
fr_fr: Si vous rencontrez des problèmes lors de votre inscription à GEE, contactez l'équipe SEPAL à :email:`sepal@fao.org`.

source: Initialize the **Home** folder
fr_fr: Initialiser le dossier **Home**

source: To use your GEE account in the SEPAL interface, you need to set up the **Home** folder, where all of your **Assets** (i.e. **Vectors**, **Rasters**, **Collections**, **Mosaics** and **Classifications**) will be exported. Failing to set up this folder will prevent you from successfully executing export requests.
fr_fr: Pour utiliser votre compte GEE dans l'interface SEPAL, vous devez configurer le dossier **Home** où tous vos **assets** (i.e. **Vectors**, **Rasters**, **Collections**, **Mosaïques** et **Classifications**) seront exportés. Ne pas configurer ce dossier vous empêchera d'exécuter avec succès les demandes d'exportation.

source: To set up the **Home** folder, go to the **Earth Engine Code Editor**.
fr_fr: Pour configurer le dossier **Home**, allez dans **l'éditeur de code Earth Engine**.

source: The page is divided into three zones and a map:
fr_fr: La page est divisée en trois zones et une carte :

source: **Zone 1**: Provides you with access to your GEE account information, which is divided into three panes:
fr_fr: **Zone 1** : vous donne accès aux informations de votre compte GEE, qui sont divisées en trois volets :

source: **Assets**: Displays all of the assets in your account.
fr_fr: **Assets** : Affiche tous les assets de votre compte.

source: **Scripts**: Displays all of the scripts available with your account (shared and written).
fr_fr: **Scripts**: Affiche tous les scripts disponibles avec votre compte (partagés et écrits).

source: **Doc**: Displays documentation of the JS GEE API, if you need to code in this editor.
fr_fr: **Doc**: Affiche la documentation de l'API JS GEE, si vous avez besoin de coder dans cet éditeur.

source: **Zone 2**: Allows advanced users to code their own scripts using the GEE JS API.
fr_fr: **Zone 2** : Permet aux utilisateurs avancés de coder leurs propres scripts en utilisant l'API GEE JS.

source: **Zone 3**: Displays information about current processes, which is divided into three panes:
fr_fr: **Zone 3** : Affiche des informations sur les processus actuels, qui sont divisés en trois volets :

source: **Inspector**: Transforms the arrow of the mouse into a pointer, allowing you to click anywhere on the map to view information about what you are displaying.
fr_fr: **Inspector** : Transforme la flèche de la souris en un pointeur, vous permettant de cliquer n'importe où sur la carte pour afficher des informations sur ce que vous affichez.

source: **Tasks**: Displays all of the tasks of your account, as well as their statuses (i.e. *running*, *finished* or *failed*).
fr_fr: **Tasks** : Affiche toutes les tâches de votre compte, ainsi que leurs statuts (*running*, *finished* ou *failed*).

source: **Console**: Displays the console panel of running scripts.
fr_fr: **Console** : Affiche le panneau console des scripts en cours d'exécution.

source: Go to **Zone 1** > Select **Assets** > Select **Create home folder**.
fr_fr: Allez dans **Zone 1** > Sélectionnez **Assets** > Sélectionnez **Create home folde**.

source: Select the name of the folder (Note: This can only be set once and never changed; if you're not satisfied with the suggested name, you can create your own, as long as there are no spaces or special characters).
fr_fr: Sélectionnez le nom du dossier (Note : Ceci ne peut être défini qu'une seule fois et ne peut jamais être modifié; si vous n'êtes pas satisfait du nom suggéré, vous pouvez créer le vôtre, tant qu'il n'y a pas d'espaces ou de caractères spéciaux).

source: When you return to your list of **Assets** (located in the **Zone 1** panel), you should see the name you provided as the first folder at the root of the asset tree. In this example, we used *galatheetest*:
fr_fr: Lorsque vous revenez à votre liste d'**assets** (situés dans le panneau **Zone 1**), vous devriez voir le nom que vous avez fourni comme premier dossier à la racine de l'arborescence. Dans cet exemple, nous avons utilisé *galatheetest* :

source: Now that you have initialized your GEE account, you can start the connection process between SEPAL and GEE.
fr_fr: Maintenant que vous avez initialisé votre compte GEE, vous pouvez démarrer le processus de connexion entre SEPAL et GEE.

source: Connection between GEE and SEPAL
fr_fr: Connexion entre GEE et SEPAL

source: SEPAL can work without being connected to your GEE account, but you will miss numerous opportunities to leverage the platform's potential.
fr_fr: SEPAL peut fonctionner sans être connecté à votre compte GEE, mais vous manquerez de nombreuses opportunités pour tirer parti du potentiel de la plateforme.

source: In this section, the connection procedure between GEE and SEPAL will be presented.
fr_fr: Dans cette section, la procédure de connexion entre GEE et SEPAL sera présentée.

source: Connection
fr_fr: Connexion

source: Go to `sepal.io <https://sepal.io>`__ and sign in.
fr_fr: Allez sur `sepal.io <https://sepal.io>`__ et connectez-vous.

source: Select your **Username** in the lower-right side of the window (e.g. (:code:`prambaud`) in red in the image below).
fr_fr: Sélectionnez votre **nom d'utilisateur** dans le côté inférieur droit de la fenêtre (par exemple (:code:`prambaud`) en rouge dans l'image ci-dessous).

source: Next to the Google logo (:icon:`fa-brands fa-google`) on the upper-right side of the **User Details** pop-up window, you will see the status of the connection between your SEPAL and GEE accounts (Note: if you have not connected your accounts, it will read *Disconnected*).
fr_fr: À côté du logo Google (:icon:`fa-brands fa-google`) en haut à droite de la fenêtre pop-up **Détails de l'utilisateur**, vous verrez l'état de la connexion entre vos comptes SEPAL et GEE (Note : si vous n'avez pas connecté vos comptes, vous lirez *Déconnecté*).

source: Select **Google account** in the lower section of the pop-up window (Note: if your GEE account is disconnected, you will see text that reminds you what functionalities are unavailable without a custom GEE account).
fr_fr: Sélectionnez **Compte Google** dans la section inférieure de la fenêtre pop-up (Remarque : si votre compte GEE est déconnecté, vous verrez du texte qui vous rappelle quelles fonctionnalités ne sont pas disponibles sans un compte GEE personnalisé).

source: Select **Connect your Google account** in the pop-up window that appears. Choose the account associated with GEE in the list.
fr_fr: Sélectionnez **Connectez votre compte Google** dans la fenêtre pop-up qui apparaît. Choisissez le compte associé à GEE dans la liste.

source: You will see a message requesting your permission to authorize SEPAL's access to your Google Drive, as well as your **Assets** and **Home** folders to export recipes and module results.
fr_fr: Vous verrez un message demandant votre autorisation d'autoriser SEPAL à accéder à votre Google Drive, ainsi que vos dossiers **Assets** et **Home** pour exporter les recettes et les résultats des modules.

source: After the connection process is complete, you will be redirected to the SEPAL website. If you select **User interface** again, the pop-up window will display *Connected* in green in the upper-right.
fr_fr: Une fois le processus de connexion terminé, vous serez redirigé vers le site Web de SEPAL. Si vous sélectionnez à nouveau **Interface utilisateur**, la fenêtre pop-up affichera *Connecté* en vert en haut à droite.

source: Disconnection
fr_fr: Se déconnecter

source: If you want to change accounts or remove the link between your SEPAL and GEE accounts, you can disconnect SEPAL from GEE at any time.
fr_fr: Si vous voulez changer de compte ou supprimer le lien entre vos comptes SEPAL et GEE, vous pouvez déconnecter SEPAL de GEE à tout moment.

source: Return to the user interface and select **Google account**. You should see the following window:
fr_fr: Retournez à l'interface utilisateur et sélectionnez **compte Google**. Vous devriez voir la fenêtre suivante :

source: Select **Disconnect your Google account**.
fr_fr: Sélectionnez **Déconnecter votre compte Google**.

source: When you use SEPAL recipes and modules, you'll be asked to use GEE assets to provide rasters (:code:`ee.Image`) or vectors (:code:`ee.FeatureCollection`) to the core GEE-based algorithm. These assets can be either public assets that someone shared with you or assets that you created yourself and would like to use.
fr_fr: Lorsque vous utilisez des recettes SEPAL et des modules, il vous sera demandé d'utiliser les assets GEE pour fournir des rasters (:code:`ee.Image`) ou des vecteurs (:code:`ee. eatureCollection`) à l'algorithme de base GEE. Ces assetspeuvent être soit des assetspublics que quelqu'un a partagés avec vous ou des assets que vous avez créés vous-même et que vous aimeriez utiliser.

source: For vector files, SEPAL provides an interface to upload them from your computer to the platform and eventually to GEE. This process allows you to deal with the full process directly from SEPAL without going to the **Earth Engine Code Editor** (see the :doc:`../modules/dwn/vector_manager` module documentation for more details).
fr_fr: Pour les fichiers vectoriels, SEPAL fournit une interface pour les télécharger depuis votre ordinateur vers la plate-forme et éventuellement vers GEE. Ce processus vous permet de traiter le processus complet directement à partir de SEPAL sans aller à **l'Éditeur de Code de Earth Engine** (voir le :doc:`. /modules/dwn/vector_manager` module documentation pour plus de détails).

source: Go to **Assets** in the **Zone 1** panel on the **Earth Engine Code Editor** page:
fr_fr: Allez sur les **Assets** du panneau **Zone 1** de la page **Éditeur de code de Earth Engine** :

source: Select **New**. You will have several choices, including raster, shape, and table, which will be described in the following sections.
fr_fr: Sélectionnez **New**. Vous aurez plusieurs choix, y compris raster, forme et table, qui seront décrits dans les sections suivantes.

source: If you need to upload a raster image:
fr_fr: Si vous avez besoin de télécharger une image matricielle:

source: Select **Image**.
fr_fr: Sélectionnez **Image**.

source: In the pop-up window that appears, select the file you want to upload from your computer (Note: compatible formats include :code:`.tiff`, :code:`.tif`, :code:`.json`, :code:`.tfrecord` or :code:`.tfrecord.gz`; the name of your asset can be changed in the next text field).
fr_fr: Dans la fenêtre pop-up qui apparaît, sélectionnez le fichier que vous voulez télécharger à partir de votre ordinateur (Note : les formats compatibles incluent :code:`. iff`, :code:`. si`, :code:`.json`, :code:`.tfrecord` ou :code:`.tfrecord.gz`; le nom de votre actif peut être changé dans le champ de texte suivant).

source: By default, the asset will be named after the base-name.
fr_fr: Par défaut, la ressource sera nommée d'après le nom du fichier original.

source: Shape
fr_fr: Forme

source: If you need to upload a shape as a :code:`ee.FeatureCollection`:
fr_fr: Si vous avez besoin de télécharger une forme en tant que :code:`ee.FeatureCollection`:

source: Select **Shape upload**.
fr_fr: Sélectionnez **Shape upload**.

source: In the pop-up window that appears, select the file you want to upload from your computer (note: compatible formats include :code:`.shp`, :code:`.zip`, :code:`.dbf`, :code:`.prj`, :code:`.shx`, :code:`.cpg`, :code:`.fix`, :code:`.qix`, :code:`.sbn` or :code:`.shp.xml`; if you didn't compress the file, a :code:`.shp` alone is not sufficient and must be accompanied with other files describing the shape as in the example in the image below).
fr_fr: Dans la fenêtre pop-up qui apparaît, sélectionnez le fichier que vous voulez télécharger depuis votre ordinateur (Remarque : les formats compatibles incluent :code:`. shp`, :code:`.zip`, :code:`.dbf`, :code:`.prj`, :code:`.shx`, :code:`.cpg`, :code:`. fix`, :code:`.qix`, :code:`.sbn` ou :code:`.shp.xml`; si vous n'avez pas compressé le fichier, un :code:`. shp` seul n'est pas suffisant et doit être accompagné avec d'autres fichiers décrivant la forme comme dans l'exemple dans l'image ci-dessous).

source: If you need to upload a table as a :code:`ee.FeatureCollection`:
fr_fr: Si vous avez besoin de télécharger une table en tant que :code:`ee.FeatureCollection`:

source: Select **csv file upload**.
fr_fr: Sélectionnez **csv file upload**.

source: In the pop-up window that appears, select the file you want to upload from your computer (note: compatible formats include :code:`.csv`, :code:`.json`).
fr_fr: Dans la fenêtre pop-up qui apparaît, sélectionnez le fichier que vous voulez télécharger depuis votre ordinateur (Remarque : les formats compatibles incluent :code:`.csv`, :code:`.json`).

source: Use your GEE assets in SEPAL
fr_fr: Utilisez vos assets GEE dans SEPAL

source: Once you've uploaded your assets, you can use them in SEPAL by copying and pasting the name of each anywhere SEPAL asks for an asset name.
fr_fr: Une fois que vous avez téléchargé vos assets, vous pouvez les utiliser dans SEPAL en copiant et en collant le nom de chaque endroit où SEPAL demande un nom d'asset.

source: To find the asset name, go back to **Assets** in the **Zone 1** pane and click on any asset in the list. The following pop-up window will appear:
fr_fr: Pour trouver le nom de l'asset, retournez à **Assets** dans le volet **Zone 1** et cliquez sur n'importe quelle ressource de la liste. La fenêtre pop-up suivante apparaîtra :

source: If you select **Copy link**, the link will be copied to the clipboard and you can paste it into SEPAL or send it to someone for authorized use. Alternatively, you can select **Share** in the pop-up window and choose between the different sharing options.
fr_fr: Si vous sélectionnez **Copy link**, le lien sera copié dans le presse-papiers et vous pouvez le coller dans SEPAL ou l'envoyer à quelqu'un pour un usage autorisé. Vous pouvez également sélectionner **Share** dans la fenêtre pop-up et choisir entre les différentes options de partage.
