Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/setup/index.po
Languages: fr_fr

source: Getting started with SEPAL
fr_fr: Se lancer avec SEPAL

source: Discover key requirements needed to use the platform
fr_fr: Découvrez les exigences clés requises pour utiliser la plateforme

source: In this section of SEPAL documentation, you can learn how to:
fr_fr: Dans cette section de la documentation de SEPAL, vous pouvez apprendre à :

source: `Register to SEPAL <https://docs.sepal.io/en/latest/setup/register.html>`__
fr_fr: `S'inscrire à SEPAL <https://docs.sepal.io/en/latest/setup/register.html>`__

source: `Use Google Earth Engine (GEE) with SEPAL <https://docs.sepal.io/en/latest/setup/gee.html>`__
fr_fr: `Utilisez Google Earth Engine (GEE) avec SEPAL <https://docs.sepal.io/en/latest/setup/gee.html>`__

source: `Use Norway’s International Climate and Forests Initiative (NICFI) - Planet Lab data <https://docs.sepal.io/en/latest/setup/nicfi.html>`__
fr_fr: `Utilisez les données de l'Initiative internationale sur le climat et les forêts de Norvège (NICFI) - Planet Lab <https://docs.sepal.io/en/latest/setup/nicfi.html>`__

source: `Exchange files with SEPAL <https://docs.sepal.io/en/latest/setup/filezilla.html>`__
fr_fr: `Échanger des fichiers avec SEPAL <https://docs.sepal.io/fr/latest/setup/filezilla.html>`__

source: `Manage your resources <https://docs.sepal.io/en/latest/setup/resource.html>`__
fr_fr: `Gérer vos ressources <https://docs.sepal.io/fr/latest/setup/resource.html>`__

source: `Reset your password <https://docs.sepal.io/en/latest/setup/password.html>`__
fr_fr: `Réinitialiser votre mot de passe <https://docs.sepal.io/fr/latest/setup/password.html>`__

source: Navigate to other pages in this section by selecting links located in **Section navigation** in the left pane.
fr_fr: Naviguez vers d'autres pages de cette section en sélectionnant les liens situés dans **la Section de navigation** dans le volet de gauche.

source: Navigate to other sections in this article by selecting links located in **On this page** in the right pane.
fr_fr: Naviguez vers d'autres sections de cet article en sélectionnant les liens situés dans **Sur cette page** dans le volet de droite.

source: Make contributions to the documentation by selecting :icon:`fa-solid fa-pencil` **Edit this page** in the right pane.
fr_fr: Contribuez à la documentation en sélectionnant :icon:`fa-solid fa-pencil` **Modifier cette page** dans le volet de droite.

source: If you can't find what you're looking for, use the `GitHub issue tracker <https://github.com/openforis/sepal-doc/issues/new/choose>`_.
fr_fr: Si vous ne trouvez pas ce que vous cherchez, utilisez le `GitHub issue tracker <https://github.com/openforis/sepal-doc/issues/new/choose>`_.

source: For support, `ask the community <https://groups.google.com/g/sepal-users>`__ or contact the SEPAL team at :email:`sepal@fao.org`.
fr_fr: Pour obtenir de l’aide, `demandez à la communauté <https://groups.google.com/g/sepal-users>`__ ou contactez l’équipe SEPAL à :email:`sepal@fao.org`.
