Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/setup/password.po
Languages: fr_fr

source: Reset password
fr_fr: Réinitialiser le mot de passe

source: Create a new password for your SEPAL account
fr_fr: Créez un nouveau mot de passe pour votre compte SEPAL

source: In this article, you can learn how to:
fr_fr: Dans cet article, vous pouvez apprendre à :

source: Access your SEPAL account by creating new password.
fr_fr: Accédez à votre compte SEPAL en créant un nouveau mot de passe.

source: If you have forgotten the password for your SEPAL account, you can reset it by proving you have access to the email address associated with your account.
fr_fr: Si vous avez oublié le mot de passe de votre compte SEPAL vous pouvez le réinitialiser en prouvant que vous avez accès à l'adresse e-mail associée à votre compte.

source: A password may be recovered by submitting a request by following the directions located at one of the website's sign-in forms.
fr_fr: Un mot de passe peut être récupéré en soumettant une demande en suivant les instructions de l'un des formulaires de connexion du site Web.

source: Resetting passwords is not possible without knowing and having access to the email address used to sign in to the platform. Before requesting a new account with SEPAL, test all of your email accounts.
fr_fr: La réinitialisation des mots de passe n'est pas possible sans avoir accès à l'adresse e-mail utilisée pour se connecter à la plate-forme. Avant de demander un nouveau compte avec SEPAL, testez tous vos comptes de messagerie.

source: This password reset process can be performed in three steps:
fr_fr: Ce processus de réinitialisation du mot de passe peut être effectué en trois étapes:

source: Provide your email address.
fr_fr: Indiquez votre adresse e-mail.

source: Complete email verification.
fr_fr: Valider votre email de vérification.

source: Create a new password.
fr_fr: Créer un nouveau mot de passe.

source: Tell us who you are
fr_fr: Dites-nous qui vous êtes

source: Select **Forgot password** on the SEPAL landing page.
fr_fr: Sélectionnez **Mot de passe oublié** sur la page de destination SEPAL.

source: Enter the email address you used to register for SEPAL, then select **Reset password**.
fr_fr: Entrez l'adresse e-mail que vous avez utilisée pour vous inscrire sur SEPAL, puis sélectionnez **Réinitialiser le mot de passe**.

source: If the field becomes red, your email address was not found in our database. Be careful with typos and test multiple addresses, as you may have used another when you registered.
fr_fr: Si le champ devient rouge, votre adresse e-mail n'a pas été trouvée dans notre base de données. Soyez prudent avec les fautes de frappe et testez plusieurs adresses, car vous pouvez en avoir utilisé une autre lors de votre inscription.

source: Once your email address is validated, a confirmation email will be sent from SEPAL to your associated email account. The notification system will display a message containing this information in the upper-right corner of the screen.
fr_fr: Une fois votre adresse e-mail validée, un e-mail de confirmation sera envoyé de SEPAL à votre compte e-mail associé. Le système de notification affichera un message contenant ces informations dans le coin supérieur droit de l'écran.

source: Email confirmation
fr_fr: Confirmer email

source: To reset your password, SEPAL uses an email confirmation system because:
fr_fr: Pour réinitialiser votre mot de passe, SEPAL utilise un système de confirmation par e-mail car :

source: Attackers cannot lock the accounts of other users by guessing their usernames and utilizing the forgotten password recovery function.
fr_fr: Les hackers ne peuvent pas verrouiller les comptes d'autres utilisateurs en devinant leur nom d'utilisateur et en utilisant la fonction de récupération de mot de passe oubliée.

source: Passwords cannot be read from your email account by potential attackers.
fr_fr: Les mots de passe ne peuvent pas être lus depuis votre compte de messagerie par des hackers potentiels.

source: The reset links are only temporarily valid.
fr_fr: Les liens de réinitialisation ne sont que temporairement valides.

source: After someone uses a password reset link, it becomes invalid and cannot be accessed again.
fr_fr: Une fois que quelqu'un utilise un lien de réinitialisation de mot de passe, il devient invalide et ne peut plus être accédé.

source: For all of these reasons, SEPAL will send you the following email.
fr_fr: Pour toutes ces raisons, SEPAL vous enverra le courriel suivant.

source: Follow the instructions to reset your password on a new browser page.
fr_fr: Suivez les instructions pour réinitialiser votre mot de passe sur une nouvelle page du navigateur.

source: Change password
fr_fr: Changer le mot de passe

source: In the reset password form, three fields are available:
fr_fr: Dans le formulaire de réinitialisation du mot de passe, trois champs sont disponibles :

source: **Username**: The username associated with your email address in the database.
fr_fr: **Nom d'utilisateur** : le nom d'utilisateur associé à votre adresse e-mail dans la base de données.

source: Your username cannot be changed.
fr_fr: Votre nom d'utilisateur ne peut pas être changé.

source: **Password**: Your new password.
fr_fr: **Mot de passe** : Votre nouveau mot de passe.

source: **Confirm password**: A security field where you need to provide your new password again.
fr_fr: **Confirmez le mot de passe**: un champ de sécurité où vous devez fournir votre nouveau mot de passe.

source: Enter the new password in the **Password** and **Confirm Password** fields (Note: if the two fields are not exactly the same, the form cannot be validated).
fr_fr: Entrez le nouveau mot de passe dans les champs **Mot de passe** et **Confirmer le mot de passe** (Note: si les deux champs ne sont pas exactement les mêmes, le formulaire ne peut pas être validé).

source: Select **Set password** to validate your new password.
fr_fr: Sélectionnez **Définir le mot de passe** pour valider votre nouveau mot de passe.

source: Once validated, the new password will be automatically updated on your account. The user will be authenticated and a notification will be displayed in the upper-right.
fr_fr: Une fois validé, le nouveau mot de passe sera automatiquement mis à jour sur votre compte. L'utilisateur sera authentifié et une notification s'affichera en haut à droite.

source: For support, `ask the community <https://groups.google.com/g/sepal-users>`__.
fr_fr: Pour obtenir de l'aide, `demandez à la communauté <https://groups.google.com/g/sepal-users>`__.
