Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/setup/presentation.po
Languages: fr_fr

source: Introduction to SEPAL
fr_fr: Introduction à SEPAL

source: On this page, you will be introduced to the SEPAL interface and learn how to access SEPAL's features to facilitate the remote sensing exercises found in the rest of the documentation.
fr_fr: Sur cette page, vous serez initié à l'interface SEPAL et apprendrez comment accéder aux fonctionnalités de SEPAL pour faciliter les exercices de télédétection que l'on trouve dans le reste de la documentation.

source: **Objectives**
fr_fr: **Objectifs**

source: Navigate the SEPAL interface
fr_fr: Naviguer dans l'interface SEPAL

source: Learn about the functionalities of SEPAL
fr_fr: En savoir plus sur les fonctionnalités de SEPAL

source: **Prerequisites**
fr_fr: **Prérequis**

source: Internet access
fr_fr: Accès Internet

source: SEPAL account (see "Getting Started")
fr_fr: Compte SEPAL (voir "Démarrer")

source: Access SEPAL
fr_fr: Accéder à SEPAL

source: Navigate to `sepal.io <https://sepal.io/>`_ to open SEPAL, use the log-in form and fill your username and password and, click the :btn:`Login` button.
fr_fr: Naviguez vers `sepal.io <https://sepal.io/>`_ pour ouvrir SEPAL, utilisez le formulaire de connexion et remplissez votre nom d'utilisateur et votre mot de passe et, cliquez sur le bouton :btn:`Se connecter`.

source: When working in SEPAL, do not click your browser's back button. This will go back to the previous webpage. Use the buttons within SEPAL to navigate to previous pages. In some instances, you may find an arrow in the upper-left or upper-right corner of the SEPAL interface to navigate to a previous window.
fr_fr: Lorsque vous travaillez dans SEPAL, ne cliquez pas sur le bouton retour de votre navigateur. Cela retournera à la page Web précédente. Utilisez les boutons dans SEPAL pour accéder aux pages précédentes. Dans certains cas, vous pouvez trouver une flèche dans le coin supérieur gauche ou supérieur droit de l'interface SEPAL pour naviguer vers une fenêtre précédente.

source: Set up language
fr_fr: Définir la langue

source: The first step to create a SEPAL environment is to set up the language you want to use, follow the instructions in the video below.
fr_fr: La première étape pour créer un environnement SEPAL est de configurer la langue que vous souhaitez utiliser, suivez les instructions dans la vidéo ci-dessous.

source: You can always change your language preference from SEPAL's launch page.
fr_fr: Vous pouvez toujours modifier votre préférence de langue à partir de la page de lancement de SEPAL.

source: SEPAL is by default in English, but is also available in other languages, such as French and Spanish. To use these languages in SEPAL, return to the launch page (you may be required to logout). On this page, click on :code:`Launch`, which will provide you with access to the login page. In the upper-right side of this panel, click on the button corresponding to your language:
fr_fr: SEPAL est par défaut en anglais, mais est également disponible dans d'autres langues, comme le français et l'espagnol. Pour utiliser ces langues dans SEPAL, retournez à la page de lancement (vous devrez peut-être vous déconnecter). Sur cette page, cliquez sur :code:`Demarrer`, qui vous donnera accès à la page de connexion. Dans le côté supérieur droit de ce panneau, cliquez sur le bouton correspondant à votre langue:

source: fr: Français
fr_fr: fr : Francais

source: en: English
fr_fr: en: Anglais

source: es: Español
fr_fr: es: Espangnol

source: The SEPAL launch page should reload itself and the language you selected will be used by the platform for all of its tools.
fr_fr: La page de lancement de SEPAL devrait se recharger et la langue que vous avez sélectionnée sera utilisée par la plate-forme pour tous ses outils.

source: SEPAL interface
fr_fr: Interface SEPAL

source: Home
fr_fr: Page d’accueil

source: Once you are logged in, you will see the following screen. Notice that your username is displayed in the lower-right.
fr_fr: Une fois connecté, vous verrez l'écran suivant. Notez que votre nom d'utilisateur est affiché en bas à droite.

source: There are four main navigation tabs in the dock on the left side of the screen:
fr_fr: Il y a quatre onglets de navigation principaux dans le dock sur le côté gauche de l'écran :

source: **Process:** Select imagery and create mosaics.
fr_fr: **Processus :** Sélectionnez des images et créez des mosaïques.

source: **Files:** Navigate through your personal SEPAL folders. This is where you can download, delete, and visualize data (using the Data Visualization link).
fr_fr: **Fichiers :** Naviguez dans vos dossiers SEPAL personnels. C'est ici que vous pouvez télécharger, supprimer et visualiser des données (en utilisant le lien de visualisation des données).

source: **Terminal:** Access the command line for the LINUX server.
fr_fr: **Terminal:** Accédez à la ligne de commande du serveur LINUX.

source: **Apps:** Follow links to a variety of pre-loaded tools.
fr_fr: **Apps:** Suivez les liens vers une variété d'outils préchargés.

source: On the lower-left is the red :code:`Tasks` tab. Clicking on this brings up a list of currently-running tasks.
fr_fr: Sur la partie inférieure gauche se trouve l'onglet rouge :code:`Tâches`. Cliquer dessus fait apparaître une liste de tâches en cours d'exécution.

source: **Account Information** can be found on the lower-right side of the webpage by clicking the Username button. This opens an overlay that displays important user account information.
fr_fr: Les **Informations sur le compte** se trouvent en bas à droite de la page Web en cliquant sur le bouton Nom d'utilisateur. Cela ouvre une fenêtre qui affiche les informations importantes sur le compte utilisateur.

source: You can edit your user account info, including Name, Password, Email and Organization here. Click :code:`Save` to make those changes permanent.
fr_fr: Vous pouvez modifier les informations de votre compte utilisateur, y compris le nom, le mot de passe, l'e-mail et l'organisation ici. Cliquez sur :code:`Enregistrer` pour rendre ces modifications permanentes.

source: You cannot edit your Username in this interface.
fr_fr: Vous ne pouvez pas modifier votre nom d'utilisateur dans cette interface.

source: Link your Google Earth Engine (GEE) account with your SEPAL account by clicking **Use my own Google Account** and following the instructions. If your GEE and SEPAL accounts are connected, SEPAL uses your Google Drive as a temporary storage space for data downloaded to your SEPAL workspace (e.g. any imagery tiles or mosaics that you “retrieve to SEPAL workspace” will first be saved to your Google Drive account before being saved in your SEPAL workspace). If your GEE and SEPAL accounts are not linked, data downloads to your SEPAL workspace will still be possible and the data will pass through SEPAL's Google Drive account.
fr_fr: Associez votre compte Google Earth Engine (GEE) à votre compte SEPAL en cliquant sur **Utiliser mon propre compte Google** et en suivant les instructions. Si vos comptes GEE et SEPAL sont connectés, SEPAL utilise votre Google Drive comme espace de stockage temporaire pour les données téléchargées dans votre espace de travail SEPAL (par ex. les tuiles d’images ou mosaïques que vous « récupérez dans l’espace de travail SEPAL » seront d’abord enregistrées dans votre compte Google Drive avant d’être enregistrées dans votre espace de travail SEPAL). Si vos comptes GEE et SEPAL ne sont pas liés, les téléchargements de données dans votre espace de travail SEPAL seront toujours possibles et les données passeront par le compte Google Drive de SEPAL.

source: Unlinking your GEE and SEPAL accounts for downloading to SEPAL workspace may help if you do not have sufficient space available in your personal Google Drive.
fr_fr: Délier vos comptes GEE et SEPAL pour le téléchargement vers l'espace de travail SEPAL peut vous aider si vous n'avez pas assez d'espace disponible dans votre Google Drive personnel.

source: Linking your GEE and SEPAL accounts will allow you to read and write from your GEE Assets. To save data created in SEPAL as a GEE Asset or to use your existing GEE Assets in classifications or further processing in SEPAL, you will need to have your GEE and SEPAL accounts linked.
fr_fr: Lier vos comptes GEE et SEPAL vous permettra de lire et d'écrire à partir de vos assets GEE. Pour enregistrer les données créées avec SEPAL en tant qu'asset GEE ou pour utiliser vos assets GEE existants dans les classifications ou dans le traitement ultérieur en SEPAL, vous aurez besoin que vos comptes GEE et SEPAL soient liés.

source: Link your SEPAL and GEE accounts in order to read and write to GEE Assets from SEPAL.
fr_fr: Liez vos comptes SEPAL et GEE afin de lire et d'écrire à GEE assets de SEPAL.

source: Next to **Account Information** is a section called **User Report**, represented by the :code:`$ X/h`, which displays the status (used / available) of your processing and storage resources. Instance spending refers to the resources used / available to start and run cloud computers. Storage space and spending refers to the resources used / available for storage in your SEPAL workspace. If you are running any processes in your current session, they will show up here under Sessions.
fr_fr: À côté de **Informations sur le compte** se trouve une section appelée **Rapport d'utilisateur**, représentée par le :code:`$ X/h`, qui affiche l'état (utilisé/disponible) de vos ressources de traitement et de stockage. Les dépenses d'instance se réfèrent aux ressources utilisées/disponibles pour démarrer et exécuter des ordinateurs dans le cloud. L'espace de stockage et les dépenses se réfèrent aux ressources utilisées / disponibles pour le stockage dans votre espace de travail SEPAL. Si vous exécutez des processus dans votre session courante, ils apparaîtront ici sous Sessions.

source: SEPAL is not to be used for long-term data storage. This is costly. The platform is best used by storing only the data necessary for processing. After processing and producing a product, data should be downloaded to your personal computer and deleted from SEPAL storage.
fr_fr: SEPAL ne doit pas être utilisé pour stocker des données à long terme. La plate-forme est mieux utilisée en stockant uniquement les données nécessaires au traitement. Après le traitement et la production d'un produit, les données doivent être téléchargées sur votre ordinateur personnel et supprimées du stockage SEPAL.

source: Process Tab
fr_fr: Onglet Processus

source: Click the :code:`Process` tab on the left side of the window.
fr_fr: Cliquez sur l'onglet :code:`Processus` sur le côté gauche de la fenêtre.

source: You should now see many options in the center of the screen:
fr_fr: Vous devriez maintenant voir de nombreuses options au centre de l'écran:

source: **Optical Mosaic** Create a mosaic using Landsat and/or Sentinel 2 data. This is what we will do in Exercise 1.2.
fr_fr: **Mosaïque optique** Crée une mosaïque en utilisant les données Landsat et/ou Sentinelle 2. C'est ce que nous ferons dans l'exercice 1.2.

source: **Radar Mosaic** Create a mosaic using Sentinel 1 data.
fr_fr: **Mosaïque de radar** Crée une mosaïque en utilisant les données de la Sentinelle 1.

source: **Planet Mosaic** Create a mosaic using NICFI / Planet basemaps (if you have permission from NICFI / Planet).
fr_fr: **Planet Mosaïque** Créer une mosaïque en utilisant des basemaps NICFI / Planet (si vous avez la permission de NICFI / Planet).

source: **Classification** Use a random forest model to classify images from SEPAL or GEE. This will be the focus of Module 2.
fr_fr: **Classification** Utilisez un modèle random forest pour classer les images de SEPAL ou GEE. Ce sera l'objet du Module 2.

source: **Time Series** Download time series information to your SEPAL storage.
fr_fr: **Série temporelle** Téléchargez les informations de la série temporelle sur votre stockage SEPAL.

source: **CCDC** Create a CCDC asset from a time series.
fr_fr: **CCDC** Créer un asset CCDC à partir d'une série temporelle.

source: **CCDC Slice** Create a slice of a CCDC asset for a specific date or date range.
fr_fr: **CCDC Slice** Créer une tranche d'asset CCDC pour une plage de dates spécifique.

source: **Class Change** Create a class change map from two categorical images (either SEPAL recipes or GEE assets).
fr_fr: **Changement de classe** Créer une carte de changement de classe à partir de deux images catégoriques (soit des recettes SEPAL soit des assets GEE).

source: **Index Change** Create an index change map from two single-band images (either SEPAL recipes or GEE assets).
fr_fr: **Changement d'index** Créer une carte de changement d'index à partir de deux images à bande unique (soit des recettes SEPAL soit des assets GEE).

source: **Remapping** Remap categorical or continuous image bands into new categories.
fr_fr: **Remapping** Remapper les bandes d'images catégoriques ou continues dans de nouvelles catégories.

source: When you click on one of these options, it will open a new tab with the GUI interface that allows you to specify your desired options.
fr_fr: Lorsque vous cliquez sur l'une de ces options, il ouvrira un nouvel onglet avec l'interface graphique qui vous permettra de spécifier les options souhaitées.

source: Files Tab
fr_fr: Onglet Fichiers

source: Click the green :code:`Files` tab on the left side of the window. This will display all of your files stored in your SEPAL workspace.
fr_fr: Cliquez sur l'onglet vert :code:`Fichiers` sur le côté gauche de la fenêtre. Cela affichera tous vos fichiers stockés dans votre espace de travail SEPAL.

source: For example, click the :code:`Downloads` folder to expand it. This will display the folders containing any of the data you have downloaded in SEPAL. If you have not downloaded mosaics in SEPAL yet, this folder will be empty.
fr_fr: Par exemple, cliquez sur le dossier :code:`Downloads` pour le développer. Ceci affichera les dossiers contenant les données que vous avez téléchargées dans SEPAL. Si vous n'avez pas encore téléchargé de mosaïques dans SEPAL, ce dossier sera vide.

source: Notice that there are four buttons on the upper-right side of the window. The three rightmost buttons will be inactive until you select a file.
fr_fr: Notez qu'il y a quatre boutons sur le côté supérieur droit de la fenêtre. Les trois boutons les plus à droite seront inactifs jusqu'à ce que vous sélectionnez un fichier.

source: The left button will show hidden files (files and folder names starting with ‘.').
fr_fr: Le bouton de gauche affichera les fichiers cachés (fichiers et noms de dossier commençant par '.').

source: The second button will download selected data to your local computer.
fr_fr: Le deuxième bouton téléchargera les données sélectionnées sur votre ordinateur local.

source: The third button will delete the selected folder or file.
fr_fr: Le troisième bouton supprimera le dossier ou le fichier sélectionné.

source: The last button will clear your selection.
fr_fr: Le dernier bouton effacera votre sélection.

source: Terminal Tab
fr_fr: Onglet Terminal

source: Click the :code:`Terminal` tab on the left side of the screen.
fr_fr: Cliquez sur l'onglet :code:`Terminal` sur le côté gauche de l'écran.

source: This links you to the Linux command line that you can use in a variety of ways to manage data, load data from an outside location, or process data using a series of commands.
fr_fr: Ceci vous relie à la ligne de commande Linux que vous pouvez utiliser de différentes manières pour gérer les données, charger des données depuis un emplacement extérieur, ou traiter des données à l'aide d'une série de commandes.

source: When you initially load the Terminal, you will see information about your usage and the available types of instances you can initialize.
fr_fr: Lorsque vous chargez initialement le Terminal, vous verrez des informations sur votre utilisation et les types d'instances disponibles que vous pouvez initialiser.

source: One of the most important features of the Terminal is the ability to start and stop instances.
fr_fr: L'une des fonctionnalités les plus importantes du Terminal est la possibilité de démarrer et d'arrêter des instances.

source: To start an instance, use the following steps as a guide:
fr_fr: Pour démarrer une instance, utilisez les étapes suivantes comme guide :

source: First examine the “Available instance types” table. This is updated periodically but an example from September of 2020 is shown below.
fr_fr: Examinez d'abord le tableau « Available instance types ». Ceci est mis à jour périodiquement, mais un exemple à partir de septembre 2020 est affiché ci-dessous.

source: Choose an instance Type that fits your needs. Frequently a t2 or m2 is sufficient and cost-effective.
fr_fr: Choisissez un type d'instance qui correspond à vos besoins. Fréquemment un t2 ou m2 est suffisant et rentable.

source: Next to the “Select (t1):” text, type in "t2" or your chosen instance type.
fr_fr: À côté du texte « Select (t1):» , tapez « t2 » ou le type d'instance que vous avez choisi.

source: Press Enter on your keyboard.
fr_fr: Appuyez sur la touche "Entrer" de votre clavier.

source: Wait for the new instance to start. This will take several minutes.
fr_fr: Attendez que la nouvelle instance démarre. Cela prendra plusieurs minutes.

source: To stop an instance, type "exit" in the command line. You can then refresh the terminal page to start a new instance. You can also stop an instance by clicking on your username on the right side of the screen and accessing your account information. Under "Sessions" click on the trashcan icon to shut down your instances.
fr_fr: Pour arrêter une instance, tapez "exit" dans la ligne de commande. Vous pouvez alors rafraîchir la page du terminal pour démarrer une nouvelle instance. Vous pouvez également arrêter une instance en cliquant sur votre nom d'utilisateur à droite de l'écran et en accédant aux informations de votre compte. Sous la rubrique « Sessions », cliquez sur l'icône de la corbeille pour fermer vos instances.

source: Once an instance has stopped, you can follow the instance startup steps again to select a larger instance, if necessary.
fr_fr: Une fois qu'une instance s'est arrêtée, vous pouvez suivre à nouveau les étapes de démarrage de l'instance pour sélectionner une instance plus grande, si nécessaire.

source: Apps Tab
fr_fr: Onglet Applications

source: Click the **Apps** tab on the left side of the screen. This will open up a screen that shows applications that you can access through SEPAL. Applications are pre-programmed (typically using R or Python) to perform specific, useful tasks. Applications make use of instances and running an application will use your SEPAL computing resources.
fr_fr: Cliquez sur l'onglet **Applications** sur le côté gauche de l'écran. Cela ouvrira un écran qui montre les applications auxquelles vous pouvez accéder via SEPAL. Les applications sont pré-programmées (généralement en utilisant R ou Python) pour effectuer des tâches spécifiques et utiles. Les applications utilisent des instances et exécuter une application utilisera vos ressources informatiques SEPAL.

source: This will bring up a list of apps you can run in SEPAL. More information about each app is found by clicking on the “i” on the right hand side. Some of the apps include:
fr_fr: Ceci affichera une liste des applications que vous pouvez exécuter dans SEPAL. Plus d'informations sur chaque application se trouvent en cliquant sur le “i” du côté droit. Certaines applications incluent :

source: **R Studio:** Provides access to the R environment where you can run processing scripts and upload data to your SEPAL folder.
fr_fr: **R Studio:** Fournit un accès à l'environnement R où vous pouvez exécuter des scripts de traitement et télécharger des données dans votre dossier SEPAL.

source: **JupyterLab:** Provides access to the Python environement where you can run complex data workflows.
fr_fr: **JupyterLab:** Fournit un accès à l'environnement Python où vous pouvez exécuter des flux de données complexes.

source: **BFAST GPU:** GPU implementation of the BFAST algorithm to analyse time series.
fr_fr: **BFAST GPU :** Implémentation GPU de l'algorithme BFAST pour analyser les séries horaires.

source: **Deforestation alert analysis:** Retrieve any type of alert on a selected AOI.
fr_fr: **Deforestation alert analysis :** Récupérer n'importe quel type d'alerte sur une AOI sélectionnée.

source: **Mountain Green Cover Index:** Calculates the SDG 15.4.2: Mountain Green Cover Index at national/sub-regional scale.
fr_fr: **Mountain Green Cover Index :** Calcule le SDG 15.4.2: Index de couverture verte des montagnes à l'échelle nationale/sous-régionale.

source: **SMFM Biota:** Calculate biomass change over time using ALOS Palsar data.
fr_fr: **SMFM Biota:** Calcule le changement de biomasse au fil du temps en utilisant les données ALOS Palsar.

source: Many more that can be found in the section :doc:`../modules/index` of the documentation.
fr_fr: Bien plus peut être trouvés dans la section :doc:`../modules/index` de la documentation.

source: For support, `ask the community <https://groups.google.com/g/sepal-users>`__.
fr_fr: Pour obtenir de l'aide, `demandez à la communauté <https://groups.google.com/g/sepal-users>`__.
