Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/setup/register.po
Languages: fr_fr

source: Register to SEPAL and other key platforms
fr_fr: S'inscrire à SEPAL et à d'autres plateformes clés

source: Set up your accounts and request additional resources
fr_fr: Configurez vos comptes et demandez des ressources supplémentaires

source: In this article, you can learn how to:
fr_fr: Dans cet article, vous pouvez apprendre à :

source: :ref:`Create a SEPAL account <create>` (Mandatory)
fr_fr: :ref:`Créer un compte SEPAL <create>` (Mandatory)

source: :ref:`Request additional SEPAL resources <request>` (Recommended)
fr_fr: :ref:`Demande de ressources SEPAL supplémentaires <request>` (Recommandé)

source: :ref:`Register and connect with Google Earth Engine <GEE>` (Recommended)
fr_fr: :ref:`S'inscrire et se connecter avec Google Earth Engine <GEE>(Recommandé)

source: :ref:`Register to Collect Earth Online (CEO) <ceo>` (Optional)
fr_fr: :ref:`Enregistrez-vous à Collect Earth Online (CEO) <ceo>` (facultatif)

source: Create a SEPAL account
fr_fr: Créer un compte SEPAL

source: (Mandatory)
fr_fr: (Obligatoire)

source: Go to `sepal.io <https://sepal.io/>`__.
fr_fr: Allez sur `sepal.io <https://sepal.io/>`__.

source: Select :guilabel:`Launch` > :guilabel:`Sign up`.
fr_fr: Sélectionnez :guilabel:`Lancement` > :guilabel:`Inscription`.

source: Enter your information into the form.
fr_fr: Entrez vos informations dans le formulaire.

source: Select :btn:`<fa-solid fa-envelope> Sign up`.
fr_fr: Sélectionnez :btn:`<fa-solid fa-envelope> Inscription`.

source: Complete email verification.
fr_fr: Valider votre email de vérification.

source: Create a password.
fr_fr: Créer un mot de passe.

source: After completing registration, you can request access to the **SEPAL Users Google Group**.
fr_fr: Une fois l'inscription terminée, vous pouvez demander l'accès au **Groupe Google Utilisateurs SEPAL**.

source: Go to https://groups.google.com/g/sepal-users and select **Ask to join group**.
fr_fr: Allez sur https://groups.google.com/g/sepal-users et sélectionnez **Demandez à rejoindre le groupe**.

source: For support, go to the `Geographic Information Systems StackExchange <https://gis.stackexchange.com/questions/tagged/sepal>`__ and ask a question to the community using the **SEPAL** tag.
fr_fr: Pour obtenir de l’aide, allez sur `Geographic Information Systems StackExchange <https://gis.stackexchange.com/questions/tagged/sepal>`__ (seulement en anglais) et posez une question à la communauté en utilisant le tag **SEPAL**.

source: With your new account, you can perform basic operations, such as visualizing and processing satellite imagery, saving recipes, and navigating through the platform; however, some SEPAL features are not fully available (e.g. in the **Tabs** bar on the left, **Terminal** and **Tools** are deactivated because these functions require an instance and a quota). To get full access, go to the :ref:`request access section <request>`.
fr_fr: Avec votre nouveau compte, vous pouvez effectuer des opérations de base, telles que la visualisation et le traitement des images satellites, la sauvegarde des recettes et la navigation à travers la plateforme ; Cependant, certaines fonctionnalités SEPAL ne sont pas entièrement disponibles (e. . dans la barre **Tabs** à gauche, **Terminal** et **Outils** sont désactivés car ces fonctions nécessitent une instance et un quota). Pour obtenir un accès complet, allez à la :ref:`section demande d'accès <request>`.

source: Request additional SEPAL resources
fr_fr: Demander des ressources SEPAL supplémentaires

source: (Recommended)
fr_fr: (Recommandé)

source: To use SEPAL modules and acesss the command line terminal and development tools like Jupyter or RStudio, you will need to request processing resources.
fr_fr: Pour utiliser les modules SEPAL et accéder au terminal en ligne de commande et aux outils de développement comme Jupyter ou RStudio, vous devrez demander des ressources de traitement.

source: Select **Quota** > :btn:`<fa-solid fa-pencil> Request additional resources`.
fr_fr: Sélectionnez **Quota** > :btn:`<fa-solid fa-pencil> Demandez des ressources supplémentaires`.

source: Complete the form and select :btn:`<fa-solid fa-check> Apply`.
fr_fr: Remplissez le formulaire et sélectionnez :btn:`<fa-solid fa-check> Appliquer`.

source: If you do not know how many resources you will use, go to the `resource management <resource>` section for more information.
fr_fr: Si vous ne savez pas combien de ressources vous utiliserez, allez à la section `gestion des ressources <resource>` pour plus d'informations.

source: Applications are evaluated by the SEPAL team to prevent bots and malicious users from accessing the platform.
fr_fr: Les demandes sont évaluées par l'équipe SEPAL pour empêcher les bots et les utilisateurs malveillants d'accéder à la plate-forme.

source: Sign up for Google Earth Engine (GEE)
fr_fr: S'inscrire à Google Earth Engine (GEE)

source: While SEPAL can run computation on its own GEE account on your behalf, the SEPAL team highly recommends signing up for GEE to improve your experience.
fr_fr: Alors que SEPAL peut exécuter le calcul sur son propre compte GEE en votre nom, l'équipe SEPAL vous recommande vivement de vous inscrire à GEE pour améliorer votre expérience.

source: If you already have a Google email address, go to https://earthengine.google.com/new_signup/ to sign up for a GEE account.
fr_fr: Si vous avez déjà une adresse e-mail Google, allez sur https://earthengine.google.com/new_signup/ pour créer un compte GEE.

source: Request access to Google Earth Engine (GEE).
fr_fr: Demander l'accès à Google Earth Engine (GEE).

source: If you don't have a Google email address, go to http://mail.google.com/mail/sign-up to sign up.
fr_fr: Si vous n'avez pas d'adresse e-mail Google, allez sur http://mail.google.com/mail/sign up pour vous inscrire.

source: Once you have a GEE account, go to https://code.earthengine.google.com/ to access the interface.
fr_fr: Une fois que vous avez un compte GEE, allez sur https://code.earthengine.google.com/ pour accéder à l'interface.

source: Google Earth Enging (GEE) code editor.
fr_fr: Éditeur de code Google Earth Enging (GEE).

source: If you experience problems registering with GEE, contact the SEPAL team at :email:`sepal@fao.org`.
fr_fr: Si vous rencontrez des problèmes lors de votre inscription à GEE, contactez l'équipe SEPAL à :email:`sepal@fao.org`.

source: Sign up for Collect Earth Online (CEO)
fr_fr: Inscrivez-vous à Collect Earth Online (CEO)

source: (Optional)
fr_fr: (Facultatif)

source: To get the most out of the SEPAL platform's **Classification** and **Validation** tools, the SEPAL team highly suggests using CEO for collecting point-based training and validation data.
fr_fr: Pour tirer le meilleur parti des outils de **Classification** et de **Validation** de la plateforme SEPAL l'équipe SEPAL propose fortement d'utiliser CEO pour la collecte de données de formation et de validation basées sur des points.

source: To create a new account:
fr_fr: Pour créer un nouveau compte :

source: Open your browser (Google Chrome, Microsoft Edge, or Mozilla Firefox).
fr_fr: Ouvrez votre navigateur (Google Chrome, Microsoft Edge ou Mozilla Firefox).

source: Go to https://collect.earth.
fr_fr: Allez sur https://collect.earth.

source: Select **Register**.
fr_fr: Sélectionnez **S'inscrire**.

source: Complete the form and Select **Register**.
fr_fr: Remplissez le formulaire et sélectionnez **S'inscrire**.

source: Log in with your **Email** and **Password**.
fr_fr: Connectez-vous avec votre **email** et votre **mot de passe**.

source: CEO landing page
fr_fr: Page d'accueil de CEO

source: If you forget your password, select **Forgot your password?** and follow the instructions.
fr_fr: Si vous oubliez votre mot de passe, sélectionnez **Mot de passe oublié?** et suivez les instructions.

source: For support, `ask the community <https://groups.google.com/g/sepal-users>`__.
fr_fr: Pour obtenir de l'aide, `demandez à la communauté <https://groups.google.com/g/sepal-users>`__.
