Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/team/style_guide.po
Languages: fr

source: documentation style guide
fr: guide de style de la documentation

source: Help us maintain useful, clear, concise, consistent and fluid writing across the documentation by following the SEPAL documentation style guide.
fr: Aidez-nous à maintenir une écriture utile, claire, concise, cohérente et fluide à travers la documentation en suivant le guide de style de la documentation SEPAL.

source: Learn the basics of SEPAL documentation style and ensure that your contributions are as useful as possible for the community.
fr: Apprenez les bases du style de la documentation SEPAL et assurez-vous que vos contributions sont aussi utiles que possible pour la communauté.

source: Goals and principles
fr: Objectifs et principes

source: The goal of SEPAL documentation is to guide users through the SEPAL interface. As an external contributor or a member of the SEPAL team, think of yourself as a tour guide for users. To achieve this goal, the SEPAL team ensures that writing is:
fr: L'objectif de la documentation SEPAL est de guider les utilisateurs à travers l'interface SEPAL. En tant que contributeur externe ou membre de l'équipe SEPAL, considérez vous comme un guide touristique pour les utilisateurs. Pour atteindre cet objectif, l'équipe SEPAL s'assure que l'écriture est :

source: useful
fr: utile

source: clear
fr: claire

source: consistent
fr: cohérente

source: fluid
fr: fluide

source: Style tips
fr: Conseils de style

source: Here are some basic guidelines for following SEPAL documentation style.
fr: Voici quelques lignes directrices de base pour suivre le style de la documentation SEPAL.

source: Focus on user needs
fr: Se concentrer sur les besoins des utilisateurs

source: Consider users’ questions and goals when writing SEPAL documentation. For every article, make sure users’ questions have been addressed and answered, allowing them to achieve their goals.
fr: Considérez les questions et les objectifs des utilisateurs lors de la rédaction de la documentation SEPAL. Pour chaque article, assurez-vous que les questions des utilisateurs ont été traitées et répondues, ce qui leur permet d’atteindre leurs objectifs.

source: Be simple and direct
fr: Soyez simple et direct

source: Keep language clear, concise and fluid. Use numbered and bulleted lists, instead of long paragraphs, whenever possible.
fr: Gardez un langage clair, concis et fluide. Utilisez des listes numérotées et à puces au lieu de paragraphes longs, dans la mesure du possible.

source: Use direct tone
fr: Utiliser un ton direct

source: Use an active voice, the present tense, the second-person point of view, and the imperative mood.
fr: Utilisez une voix active, le présent de l'impératif et un point de vue à la seconde personne.

source: In simpler terms: Tell the user what to do in the moment they are reading the documentation (e.g. Open the SEPAL interface and enter your email address.). Avoid addressing the audience directly, when possible. In other words, limit the use of the words “you” and “your” (e.g. To sign up for a Google account, go to accounts.google.com/servicelogin.). When addressing the audience is necessary, use the word “you” or “your” (e.g. To reset your password, go to docs.sepal.io/en/latest/setup/password.html.).
fr: En termes plus simples : Dites à l'utilisateur ce qu'il faut faire au moment où il lit la documentation (ex. Ouvrez l'interface SEPAL et entrez votre adresse e-mail.). Éviter de s'adresser directement à l’auditoire, lorsque c’est possible, c’est-à-dire de limiter l’utilisation des mots « vous » et « votre » (ex. Pour vous inscrire à un compte Google, allez sur accounts.google.com/servicelogin.). Lorsque vous vous adressez au public, utilisez le mot « vous » ou « votre » (ex. Pour réinitialiser votre mot de passe, allez dans docs.sepal.io/en/latest/setup/password.html.).

source: Word list
fr: Liste de mots

source: Here is a list of common words used in SEPAL documentation.
fr: Voici une liste de mots communs utilisés dans la documentation SEPAL.

source: Key terminology
fr: Terminologie

source: Use the following terms, when possible.
fr: Utilisez les termes suivants, si possible.

source: The SEPAL team
fr: L'équipe SEPAL

source: The authors of the documentation should be referred to as “the SEPAL team” (e.g. The SEPAL team maintains the documentation to guide users through the SEPAL interface.). If the term, “the SEPAL team” has been overused, use the words “we” or “us” instead.
fr: Les auteurs de la documentation devraient être appelés « l'équipe SEPAL » (par ex. L'équipe SEPAL maintient la documentation pour guider les utilisateurs à travers l'interface SEPAL.). Si le terme « l’équipe SEPAL » a été surutilisé, utilisez plutôt les mots « nous » ou « nous ».

source: The SEPAL interface
fr: L'interface SEPAL

source: The interface should be referred to as the “SEPAL interface” (e.g. Open the SEPAL interface and enter your email address.).
fr: L’interface devrait être appelée « l’interface SEPAL » (par exemple, ouvrez l’interface SEPAL et entrez votre adresse e-mail).

source: SEPAL documentation
fr: Documentation SEPAL

source: The website where SEPAL documentation is located should be referred to as either “SEPAL documentation” or simply, “the documentation” (e.g. Learn more about SEPAL documentation by reading this article.).
fr: Le site Web où se trouve la documentation SEPAL doit être appelé « documentation SEPAL » ou simplement « la documentation » (ex. En savoir plus sur la documentation SEPAL en lisant cet article.).

source: A section of SEPAL documentation
fr: Une section de la documentation SEPAL

source: A section of the documentation should be referred to as a “section of SEPAL documentation” or a “section of the documentation”, as necessary (e.g. Discover how to register for SEPAL in the “Getting started” section of the documentation.).
fr: Une section de la documentation doit être appelée « section de la documentation SEPAL » ou « section de la documentation », si nécessaire (ex. Découvrez comment vous inscrire à SEPAL dans la section « Commencer » de la documentation).

source: An article within SEPAL documentation
fr: Un article dans la documentation SEPAL

source: A page within the documentation should be referred to as an “article” (e.g. Learn more about the SEPAL interface in the article, “Introduction to SEPAL” in the “Getting started with SEPAL” section.).
fr: Une page de la documentation devrait être appelée « article » (p. ex. Pour en savoir plus sur l’interface SEPAL dans l’article, « Introduction à SEPAL » dans la section « Commencer avec SEPAL ».).

source: Describing interactions with the interface
fr: Décrire les interactions avec l'interface

source: Here is a list of common words used to describe actions in the SEPAL interface.
fr: Voici une liste de mots communs utilisés pour décrire les actions dans l'interface SEPAL.

source: open
fr: ouvrir

source: close
fr: fermer

source: leave
fr: quitter

source: go to
fr: aller à

source: select
fr: sélectionner

source: choose
fr: choisir

source: enter
fr: entrer

source: sign in, sign out
fr: se connecter, se déconnecter

source: zoom, zoom in, zoom out
fr: zoomer, agrandir, réduire

source: Directional terminology
fr: Terminologie directionnelle

source: Here is a list of common words to describe location in the SEPAL interface. Indicate location in relation to objects within the interface, whenever possible.
fr: Voici une liste de mots communs décrivant l'emplacement dans l'interface SEPAL. Indiquez l'emplacement par rapport aux objets de l'interface, chaque fois que possible.

source: upper left (noun), upper-left (adjective), leftmost (adjective), on the left side of
fr: en haut à gauche (nom), supérieur gauche (adjectif), à gauche (adjectif), sur le côté gauche de

source: lower right (noun), lower-right (adjective), rightmost (adjectives), on the right side of
fr: en bas à droite (nom), inférieur droit (adjectif), à droite (adjectifs), sur le côté droit de

source: pane (instead of panel)
fr: panneau

source: Other things to consider
fr: Autres éléments à prendre en considération

source: Here are some other basic guidelines to follow when writing SEPAL documentation.
fr: Voici quelques lignes directrices de base à suivre en rédigeant la documentation SEPAL.

source: Sentence structure
fr: Structure de phrase

source: Use an active voice, the present tense, the second-person point of view, and the imperative mood, whenever possible (e.g. Open the SEPAL interface and enter your email address.).
fr: Utilisez une voix active, le présent de l'impératif, un point de vue à la seconde personne, chaque fois que possible (e. . Ouvrez l'interface SEPAL et entrez votre adresse e-mail.).

source: Capitalization
fr: Majuscules

source: Use sentence case (i.e. capitals only for the initial letter of the phrase and any proper names), except when mirroring appearance of text in the SEPAL interface.).
fr: Respecter la ponctuation (c.-à-d. les majuscules uniquement pour la lettre initiale de la phrase et Les noms appropriés), sauf lorsque le texte est en miroir dans l'interface SEPAL.

source: Quotation marks
fr: Guillemets

source: Use double quotation marks for titles of articles and sections (e.g. The “Getting started” section.). Use double quotation marks for direct quotes (e.g. for the text displayed in an error message.).
fr: Utiliser des guillemets doubles pour les titres des articles et des sections (par exemple, la section « Commencer ».). Utilisez les guillemets doubles pour les guillemets directs (par exemple, pour le texte affiché dans un message d'erreur).

source: Bold
fr: Gras

source: Use bold formatting for the names of buttons, checkboxes, panes, drop-down menus, and other options (e.g. Select Export.).
fr: Utiliser le formatage en gras pour les noms des boutons, des cases à cocher, des panneaux, des menus déroulants et d'autres options (par exemple, Select Export.).

source: Italic
fr: Italique

source: Use italicized text for introducing key terminology (only italics only at first mention) (e.g. There is formal QA/QC and informal QA/QC.).
fr: Utilisez du texte en italique pour introduire la terminologie clé (uniquement en italique à la première mention) (par exemple, il y a un QA/QC formel et un QA/QC informel).

source: Further reading
fr: Pour en savoir plus

source: To find answers to questions not available in the SEPAL documentation style guide, go to the following links:
fr: Pour trouver des réponses aux questions qui ne sont pas disponibles dans le guide de style de la documentation SEPAL, allez sur les liens suivants :

source: `FAOSTYLE (2022) <https://www.fao.org/3/cb8081en/cb8081en.pdf>`__ (for general style guidelines according to FAO)
fr: `FAOSTYLE (2022) <https://www.fao.org/3/cb8081en/cb8081en.pdf>`__ (pour les directives générales de style selon la FAO)

source: `GitHub documentation <https://docs.github.com/en>`__ (for exemplary documentation)
fr: `Documentation GitHub <https://docs.github.com/en>`__ (pour une documentation exemplaire)

source: `Microsoft style guide <https://learn.microsoft.com/en-us/docs/>`__ (for an exemplary style guide, specifically for documentation)
fr: `Guide de style Microsoft <https://learn.microsoft.com/en-us/docs/>`__ (pour un guide de style exemplaire, spécifiquement pour la documentation)

source: `“Procedures and instructions” <https://docs.microsoft.com/en-us/style-guide/procedures-instructions/>`__ (for a guide on writing these elements)
fr: `"Procédures et instructions" <https://docs.microsoft.com/en-us/style-guide/procedures-instructions/>`__ (pour un guide sur l'écriture de ces éléments)

source: `“Describing interactions with UI” <https://learn.microsoft.com/en-us/style-guide/procedures-instructions/describing-interactions-with-ui>`__ (for a guide on writing these elements)
fr: `"Décrire les interactions avec l'interface utilisateur" <https://learn.microsoft.com/en-us/style-guide/procedures-instructions/describing-interactions-with-ui>`__ (pour un guide sur l'écriture de ces éléments)
