Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/feature/aoi_selector.po
Languages: fr_fr

source: Area of Interest Selection
fr_fr: Sélection du domaine d'intérêt

source: In the majority of SEPAL modules, the first mandatory input, is the area of interest (AOI), this input will be used as a boundary to cut the processes and its outputs. Depending on if you are using the default :btn:`<fas fa-globe>` process recipes or the :btn:`<fas fa-wrench>` custom applications you will find different user interfaces.
fr_fr: Dans la majorité des modules SEPAL, la première entrée obligatoire, est le domaine d'intérêt (AOI), cette entrée sera utilisée comme limite pour couper les processus et leurs sorties. Selon que vous utilisez les recettes de processus par défaut :btn:`<fas fa-globe>` ou les applications personnalisées :btn:`<fas fa-wrench>`vous trouverez différentes interfaces utilisateurs.

source: Recipe AOI
fr_fr: Recette AOI

source: The recipes are accessible through the orange :btn:`<fas fa-globe>` globe icon located at the left side of the SEPAL window.
fr_fr: Les recettes sont accessibles par l'icône doré de globe :btn:`<fas fa-globe>` située sur le côté gauche de la fenêtre SEPAL.

source: For many of the recipes, an area of interest has to be selected. Locate the AOI selection button at the bottom right corner. Click the :guilabel:`AOI` button to open the selection window.
fr_fr: Pour beaucoup de recettes, il faut choisir une zone d'interêt. Localisez le bouton de sélection AOI en bas à droite. Cliquez sur le bouton :guilabel:`AOI` pour ouvrir la fenêtre de sélection.

source: There are multiple methods to select AOI's in the SEPAL process recipes:
fr_fr: Il y a plusieurs méthodes pour sélectionner les AOI dans les recettes de processus SEPAL :

source: Country/province (administrative boundaries).
fr_fr: Pays/province (frontières administratives).

source: EE Tables (Earth Engine).
fr_fr: EE Tables (GEE).

source: Drawn polygons.
fr_fr: Polygones personnalisés.

source: The selected method at this step is not definitive, you can change it at any stage by simply clicking the :btn:`<fa fa-globe> selected method` dropdown on the top of the AOI window and a list with the available methods will be displayed.
fr_fr: La méthode sélectionnée à cette étape n'est pas définitive, vous pouvez le modifier à n'importe quel stade en cliquant simplement sur :btn:`<fa fa-globe> méthode selectionnée` en haut de la fenêtre AOI et une liste avec les méthodes disponibles sera affichée.

source: Administrative boundaries
fr_fr: Limites administratives

source: You can select administrative layers as AOI. These geometries are extracted from the `FAO GAUL Level 0 <https://data.apps.fao.org/map/catalog/srv/eng/catalog.search?id=12691#/metadata/9c35ba10-5649-41c8-bdfc-eb78e9e65654>`__ dataset available on `GEE <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level0>`__. To use them, select the :guilabel:`Select country/province` method in the dropdown list.
fr_fr: Vous pouvez sélectionner les couches administratives comme AOI. Ces géométries sont extraites du jeu de données `FAO GAUL Level 0 <https://data.apps.fao.org/map/catalog/srv/eng/catalog.search?id=12691#/metadata/9c35ba10-5649-41c8-bdfc-eb78e9e65654>`__ disponible sur `GEE <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level0>`__. Pour les utiliser, sélectionnez la méthode :guilabel:`Sélectionnez un pays/province` dans la liste déroulante.

source: As GEE does not support non-Latin characters, accents and special characters have been removed from country and province names.
fr_fr: Comme GEE ne prend pas en charge les caractères non-latins, les accents et les caractères spéciaux ont été retirés des noms de pays et de province.

source: In the first dropdown menu, you will be able to select a Country (administrative layer 0) from the country list and optionally, you can select a province (administrative level 1) within the country selected. The dropdown list is updated on the fly with the 1st administrative level boundaries according to the country selection. If nothing is selected, the whole country will be considered.
fr_fr: Dans le premier menu déroulant, vous serez en mesure de sélectionner un pays (couche administrative 0) dans la liste des pays et, en option, vous pouvez sélectionner une province (niveau administratif 1) dans le pays sélectionné. La liste déroulante est mise à jour à la volée avec le 1er niveau administratif en fonction de la sélection du pays. Si rien n'est sélectionné, tout le pays sera considéré.

source: A buffer can be applied to the AOI boundaries, define its size using the provided slider (in km). It is by default set to 0, i.e. disabled.
fr_fr: Un buffer peut être appliqué aux limites AOI, définir sa taille en utilisant le curseur fourni (en km). Par défaut, la valeur est 0, c'est-à-dire désactivée.

source: The area of interest and preview will take longer to show up when buffering is enabled.
fr_fr: La zone d'intérêt et l'aperçu mettent plus de temps à s'afficher lorsque le buffer est activée.

source: Once all the parameters are selected, the AOI will be previewed in the small map at the bottom of the frame. To validate it click the :btn:`<fa fa-check> Apply` button. Once validated, the map will zoom on the AOI and draw it in grey on the map.
fr_fr: Une fois que tous les paramètres sont sélectionnés, l'AOI sera prévisualisé dans la petite carte en bas du cadre. Pour le valider, cliquez sur le bouton :btn:`<fa fa-check> Appliquer`. Une fois validée, la carte va zoomer sur l'AOI et la dessiner en gris sur la carte.

source: EE table
fr_fr: Tables EE

source: In the first dropdown, provide a completely qualified GEE asset name (e.g. :code:`projects/gtfp-fao/assets/aoi_ecowas`).
fr_fr: Dans la première liste déroulante, fournissez un nom d'assetGEE entièrement qualifié (par exemple :code:`projects/gtfp-fao/assets/aoi_ecowas`).

source: Make sure you have access to this asset. If that is not the case, ask the owner of the source to modify the sharing permission, otherwise, you won't be able to use the dataset.
fr_fr: Assurez-vous d'avoir accès à cet actif. Si ce n'est pas le cas, demandez au propriétaire de la source de modifier l'autorisation de partage, sinon, vous ne pourrez pas utiliser le jeu de données.

source: Select :guilabel:`include all` and the whole geometries associated with the features will be used as an AOI.
fr_fr: Sélectionnez :guilabel:`include all` et l'ensemble des géométries associées aux features seront utilisées comme une AOI.

source: Select :guilabel:`filter` and you will be able to provide a column name and a value to filter the table. The Aoi will then be reduced to the filtered features in the input asset.
fr_fr: Sélectionnez :guilabel:`filter` et vous serez en mesure de fournir un nom de colonne et une valeur pour filtrer la table. Le Aoi sera alors réduit aux features filtrées de l'asset d'entrée.

source: A buffer can be applied on these boundaries, define its size using the provided slider (in km). It is by default set to :code:`0`, i.e. disabled.
fr_fr: Un buffer peut être appliqué aux frontières, vous pouvez definir sa taille en utilisant le curseur fourni (en km). Par défaut, la valeur est :code:`0`, c'est-à-dire désactivée.

source: The area of interest and the preview will take longer to show up when buffering is enabled.
fr_fr: La zone d'intérêt et l'aperçu mettent plus de temps à s'afficher lorsque le buffer est activée.

source: Once all the parameters are selected, the AOI will be previewed in the small map at the bottom of the frame. To validate it, click the :btn:`<fa fa-check> Apply` button. Once validated, the map will zoom in on the AOI and draw it in grey on the map.
fr_fr: Une fois que tous les paramètres sont sélectionnés, l'AOI sera prévisualisé dans la petite carte en bas du cadre. Pour le valider, cliquez sur le bouton :btn:`<fa fa-check> Appliquer`. Une fois validée, la carte va zoomer sur l'AOI et la dessiner en gris sur la carte.

source: Draw polygon
fr_fr: Dessiner un polygone

source: You can use a custom AOI defined by a drawn shape. This shape will be converted into a :code:`ee.FeatureCollection` on the fly. Select :guilabel:`draw a polygon` to use this method.
fr_fr: Vous pouvez utiliser une AOI personnalisée définie par une forme dessinée. Cette forme sera convertie en une :code:`ee.FeatureCollection` à la volée. Sélectionnez :guilabel:`dessiner un polygon` pour utiliser cette méthode.

source: The pointer in the map will be converted into a :icon:`fa fa-plus`. Click successively on the map to draw a polygon.
fr_fr: Le pointeur dans la carte sera converti en un :icon:`fa fa-plus`. Cliquez successivement sur la carte pour dessiner un polygone.

source: Once the geometry is closed, the AOI will be previewed in the small map at the bottom of the frame. To validate it click the :btn:`<fa fa-check> Apply` button. Once validated, the map will zoom on the AOI and draw it in grey on the map.
fr_fr: Une fois que tous les paramètres sont sélectionnés, l'AOI sera prévisualisé dans la petite carte en bas du cadre. Pour le valider, cliquez sur le bouton :btn:`<fa fa-check> Appliquer`. Une fois validée, la carte va zoomer sur l'AOI et la dessiner en gris sur la carte.

source: The module AOI selector is available in some of the SEPAL-contrib modules. To access an app, click the purple wrench :btn:`<fa fa-wrench>` located on the left side of the SEPAL platform, use the app's dashboard to search and open a module.
fr_fr: Le sélecteur d'AOI est disponible dans certains modules SEPAL-contrib. Pour accéder à une application, cliquez sur la clé violette :btn:`<fa fa-wrench>` située sur le côté gauche de la plate-forme SEPAL, utilisez le tableau de bord de l'application pour rechercher et ouvrir un module.

source: An AOI selector module is composed of two main sections: the available methods (1) and the map (2). Although we will mention all the features and methods available, some of them might not be available in the context of the module you are working on.
fr_fr: Dans les modules, un sélecteur d'AOI est composé de deux sections principales : les méthodes disponibles (1) et la carte (2). Bien que nous mentionnerons toutes les fonctionnalités et méthodes disponibles, Certaines d'entre elles peuvent ne pas être disponibles dans le contexte du module sur lequel vous travaillez.

source: Available methods
fr_fr: Méthodes disponibles

source: There are two types of processes that require different AOI inputs and it will depend on the way the module is created and where are the core processes done: directly in a `SEPAL instance <../modules/index.html#start-instance-manually>`__ or in GEE. Although both interfaces look exactly the same, the methods and the inner data sources might vary, e.g. the administrative definitions.
fr_fr: Il y a deux types de processus qui nécessitent des entrées AOI différentes et qui dépendront de la façon dont le module est créé et où sont effectués les processus de base : directement dans une instance `SEPAL <.. modules/index.html#start-instance-manually>`__ ou dans GEE. Bien que les deux interfaces soient exactement les mêmes, les méthodes et les sources de données internes peuvent varier, par exemple les définitions administratives.

source: Administrative definitions
fr_fr: Définition administrative

source: Similar to the previously mentioned :ref:`recipe AOI selector <recipe_aoi>`, the module AOI uses the `FAO GAUL GEE <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level0>`__ boundaries for GEE and the `GADM 3.6 <https://gadm.org/data.html>`__ features for local processes, however, in this case, the tool allows you to recurse at a maximum second administrative level. The available sources are the following:
fr_fr: Similaire au :ref:`sélecteur AOI dans les recette <recipe_aoi>` mentionné précédemment , le module AOI utilise les limites de la `FAO GAUL GEE <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level0>`__ pour GEE et `GADM 3.6 <https://gadm.org/data.html>`__ pour les processus locaux, cependant, dans ce cas, l'outil vous permet de récuperer jusqu'au niveau administratif de niveau 2. Les sources disponibles sont les suivantes :

source: Country/province (level 0): countries or provinces at level 0, available at `FAO GAUL GEE level 0 <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level0>`__
fr_fr: Pays/province (niveau 0): pays ou provinces au niveau 0, disponibles au `niveau FAO GAUL GEE 0 <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level0>`__

source: Admin level 1: first administrative level, `FAO GAUL GEE level 1 <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level1>`__.
fr_fr: Admin niveau 1: premier niveau administratif, `FAO GAUL GEE niveau 1 <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level1>`__.

source: Admin level 2: second administrative level, `FAO GAUL GEE level 2 <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level2>`__.
fr_fr: Admin niveau 2: second niveau administratif, `FAO GAUL GEE niveau 2 <https://developers.google.com/earth-engine/datasets/catalog/FAO_GAUL_2015_level2>`__.

source: Local
fr_fr: Locale

source: All the administrative levels are accessible from the `GADM website <https://gadm.org/data.html>`__ .
fr_fr: Tous les niveaux administratifs sont accessibles depuis le `site web GADM <https://gadm.org/data.html>`__ .

source: Use the :guilabel:`AOI selection method` dropdown list, and select the target administrative level, a new dropdown will load up with all the corresponding boundaries to the next administrative level that is linked with the base level, i.e. select :code:`Admin level 2` as the method, chose :code:`Colombia` as a country, select the :code:`Amazonas` department as the next level, and finally select :code:`Leticia` municipality.
fr_fr: Utilisez la liste déroulante :guilabel:`méthode de sélection AOI` et sélectionnez le niveau administratif de la cible, une nouvelle liste déroulante se chargera avec toutes les limites correspondantes au niveau administratif suivant qui est lié au niveau de base, i.e. sélectionnez :code:`Admin level 2` en tant que méthode, a choisi :code:`Colombia` comme pays, sélectionnez le departement :code:`Amazonas` comme niveau suivant, et enfin sélectionnez la municipalité :code:`Leticia`.

source: Custom geometries
fr_fr: Géometries personnalisées

source: When you are looking for a more specific area of interest, the module AOI selector have at your disposal the following options:
fr_fr: Lorsque vous recherchez une zone d'intérêt plus spécifique, le sélecteur de module AOI dispose des options suivantes :

source: Vector file
fr_fr: Fichier de vecteur

source: Drawn shape
fr_fr: Forme dessinée

source: Point file
fr_fr: Fichier de point

source: GEE asset
fr_fr: Asset GEE

source: he available vector formats are: [:code:`.shp`, :code:`.geojson`, :code:`.gpkg`, :code:`.kml`]. Once selected, the module will transform its original coordinate system into :code:`EPSG:4326`.
fr_fr: les formats vectoriels disponibles sont : [:code:`.shp`, :code:`.geojson`, :code:`.gpkg`, :code:`.kml`]. Une fois sélectionné, le module transformera son système de coordonnées original en :code:`EPSG:4326`.

source: Remember that if the module you are using is doing the computation in GEE, a new :code:`feature collection` asset will be created and stored in you GEE root folder using the name of the provided file prefixed by :code:`aoi_`.
fr_fr: N'oubliez pas que si le module que vous utilisez fait le calcul dans GEE, un nouvel asset :code:`featureCollection` sera créée et stockée dans votre dossier racine GEE en utilisant le nom du fichier fourni préfixé par :code:`aoi_`.

source: Use this option to manually draw geometries in the map. Select the :guilabel:`Drawn shapes` method in the dropdown list, and optionally create a name for your draw, if not provided, the tool will assign a unique name containing the following structure:
fr_fr: Utilisez cette option pour dessiner manuellement des géométries dans la carte. Sélectionnez la méthode :guilabel:`Dessiner des formes` dans la liste déroulante, et créez éventuellement un nom pour votre géometrie, si non fourni, l'outil assignera un nom unique contenant la structure suivante :

source: If the module you are using is doing the process in GEE, a new asset will be created and stored in the root of your GEE account with the given name prefixed by :code:`aoi_`.
fr_fr: Si le module que vous utilisez fait le processus dans GEE, un nouvel asset sera créé et stocké à la racine de votre compte GEE avec le nom donné préfixé par :code:`aoi_`.

source: Three drawing geometries will be shown up at the top left corner of the map: a :btn:`<fa fa-draw-polygon>` polygon, a :btn:`<fas fa-square>` square and a :btn:`<fas fa-circle>` circle.
fr_fr: Trois géométries de dessin seront affichées en haut à gauche de la carte : un polygone de :btn:`<fa fa-draw-polygon>` un carré :btn:`<fas fa-square>` et un cercle :btn:`<fas fa-circle>`.

source: To draw, zoom in at your area of interest by using the mouse wheel or the :btn:`<fas fa-plus-square>` and :btn:`<fas fa-minus-square>` buttons located at the top right corner.
fr_fr: Pour dessiner, zoomez à votre zone d'intérêt en utilisant la molette de la souris ou les boutons :btn:`<fas fa-plus-square>` et :btn:`<fas fa-minus-square>` situés en haut à droite.

source: :btn:`<fa fa-draw-polygon>` (polygon): Draw your custom polygon by clicking the vertices of the geometry in the map. To close and finish your geometry, click the first vertex or use the :guilabel:`finish` button. Note that once you select the polygon geometry, three new buttons will be available at the top of the map: :guilabel:`Finish`, :guilabel:`Delete last point` and :guilabel:`Cancel`.
fr_fr: :btn:`<fa fa-draw-polygon>` (polygone) : Dessinez votre polygone personnalisé en cliquant sur les sommets de la géométrie dans la carte. Pour fermer et terminer votre géométrie, cliquez sur le premier sommet ou utilisez le bouton :guilabel:`finish`. Notez qu'une fois que vous avez sélectionné la géométrie du polygone, trois nouveaux boutons seront disponibles en haut de la carte: :guilabel:`Finish`, :guilabel:`Supprimer le dernier point` et :guilabel:`Annuler`.

source: :btn:`<fas fa-square>` (rectangle): Click the top left corner of the rectangle in the map, it will be the first vertex of the geometry, now, —without clicking—, move the mouse to the opposite corner (bottom left) and click the map, it will close the geometry and the rectangle will be colored in a teal color.
fr_fr: :btn:`<fas fa-square>` (rectangle) : Cliquez sur le coin supérieur gauche du rectangle dans la carte, ce sera le premier sommet de la géométrie maintenant, sans clic, déplacer la souris vers le coin opposé (en bas à gauche) et cliquer sur la carte, elle fermera la géométrie et le rectangle sera coloré dans une couleur bleue.

source: Use this method to load a single or multiple point dataset. Select :guilabel:`Point file` in the dropdown method list. Four new widgets will appear: a File selector (1) and three dropdown lists: ID (2), Longitude (3) and Latitude (4).
fr_fr: Utilisez cette méthode pour charger un ou plusieurs jeux de données. Sélectionnez :guilabel:`Fichier Point` dans la liste déroulante des méthodes. Quatre nouveaux widgets apparaîtront : un sélecteur de fichiers (1) et trois listes déroulantes : ID (2), Longitude (3) et Latitude (4).

source: Use the file selector widget to navigate through your SEPAL environment and search a table file (:code:`.csv` or :code:`.txt`) containing the coordinates of your points. Make sure the file use the following structure: - at least 3 columns - 1 providing an id (unique point identifier) - 1 providing longitude coordinates - 1 providing latitude coordinates
fr_fr: Utilisez le widget de sélection de fichiers pour naviguer dans votre environnement SEPAL et rechercher un fichier de table (:code:`.csv` ou :code:`.txt`) contenant les coordonnées de vos points. Assurez-vous que le fichier utilise la structure suivante : - au moins 3 colonnes - 1 fournissant un id (identifiant de point unique) - 1 fournissant des coordonnées de longitude - 1 fournissant des coordonnées de latitude

source: The points coordinates need to be set in :code:`EPSG:4326`.
fr_fr: Les coordonnées des points doivent être définies dans :code:`EPSG:4326`.

source: Here is an example of a compatible point file:
fr_fr: Voici un exemple de fichier point compatible :

source: Once the table is loaded, the system will try to automatically identify the :guilabel:`Id`, :guilabel:`Longitude` and :guilabel:`Latitude` columns. When this is not possible, the fields will remain empty and you will have to manually match them.
fr_fr: Une fois la table chargée, le système essaiera d'identifier automatiquement les colonnes :guilabel:`Id`, :guilabel:`Longitude` et :guilabel:`Latitude`. Si ce n'est pas possible, les champs resteront vides et vous devrez les trouver manuellement.

source: note that the columns don't have to be named with any specific structure, the only requirement is that your dataset has to be composed of an Id, Longitude, and Latitude columns.
fr_fr: notez que les colonnes n'ont pas à être nommées avec une structure spécifique, la seule condition est que votre jeu de données doit être composé de colonnes Id, Longitude et Latitude.

source: Use this method to load a custom feature collection available as an asset in GEE. Select :guilabel:`GEE asset name` in the dropdown method list. Two widgets will appear by default: an Asset selector (1), a dropdown list containing the columns of the selected asset (2) and optionally the column unique fields (3).
fr_fr: Utilisez cette méthode pour charger une collection de features personnalisées disponible en tant qu'asset dans GEE. Sélectionnez :guilabel:`GEE asset name` dans la liste déroulante. Deux widgets apparaîtront par défaut : un sélecteur d'actif (1), une liste déroulante contenant les colonnes de la ressource sélectionnée (2) et optionnellement les champs uniques de la colonne (3).

source: The File selector widget will search for all the :code:`Table` assets (i.e. Feature Collection) stored in your GEE account. You can also copy and paste in the text field a custom third-party asset, however, be sure that you have the access permission, otherwise, the module won't be able to use that source and an error will be displayed.
fr_fr: Le widget de sélection de fichiers va rechercher tous les asset :code:`Table` (c'est-à-dire featureCollection) stockés dans votre compte GEE. Vous pouvez également copier et coller dans le champ de texte un asset tiers personnalisé, cependant, assurez-vous que vous avez l'autorisation d'accès, sinon, le module ne pourra pas utiliser cette source et une erreur sera affichée.
