Repository: 12rambau/sepal-doc
Catalog: docs/source/_locale/*/LC_MESSAGES/feature/project.po
Languages: fr_fr

source: SEPAL recipies' projects
fr_fr: Projets de recettes SEPAL

source: When interacting with SEPAL processes, a user will create "recipes". These recipes can be interconnected and work together inside a single project e.g. the :code:`Mosaics` used in a :code:`Classification`. To help users deal with these interconnections SEPAL is providing a :code:`Project` system that will help them to organize their works.
fr_fr: Lorsque vous interagissez avec les processus SEPAL, un utilisateur créera des "recettes". Ces recettes peuvent être interconnectées et travailler ensemble dans un seul projet par ex. les :code:`Mosaics` utilisés dans une :code:`Classification`. Pour aider les utilisateurs à gérer ces interconnexions, SEPAL fournit un système de :code:`Project` qui les aidera à organiser leurs travaux.

source: Overview
fr_fr: Aperçu

source: Go to the processes interface of SEPAL (:btn:`<fas fa-globe>`) you should see the following, completed by a list of existing recipes if you've already created some in the previous releases.
fr_fr: Allez à l'interface processus de SEPAL (:btn:`<fas fa-globe>`) vous devriez voir ce qui suit, complétée par une liste de recettes existantes si vous en avez déjà créé quelques-unes dans les versions précédentes.

source: the following intercation are available on this page:
fr_fr: l'interaction suivante est disponible sur cette page :

source: add a recipe
fr_fr: ajouter une recette

source: manage the project
fr_fr: gérer le projet

source: select a project
fr_fr: sélectionner un projet

source: order recipies by name or update date
fr_fr: trier les recettes par nom ou par date de création

source: edit recipes
fr_fr: éditer les recettes

source: In the next section we'll present how one can create a new project and manage the existing projects in its SEPAL account.
fr_fr: Dans la section suivante, nous présenterons comment créer un nouveau projet et gérer les projets existants dans son compte SEPAL.

source: Project
fr_fr: Projet

source: Projets are personnal, they cannot be shared and they are not visible to other users.
fr_fr: Les Projets sont personnels, ils ne peuvent pas être partagés et ils ne sont pas visibles aux autres utilisateurs.

source: For every user a :code:`[no project]` project is created at registration step. This project will be the fallback for every recipes that was created before the publication of the feature. It cannot be deleted or renamed.
fr_fr: Pour chaque utilisateur, un projet :code:`[no projetc]` est créé à l'étape d'inscription. Ce projet sera la solution de secours pour toutes les recettes qui ont été créées avant la publication de la fonctionnalité. Il ne peut pas être supprimé ou renommé.

source: To create a project, click on :btn:`<fas fa-folder-tree> Projects`. It will open the following interface. then click on :btn:`<fas fa-pencil-alt> Add` to create a new project. Simply fill the name and press :btn:`<fas fa-check> Apply` to validate it. The newly created project will apear in the list.
fr_fr: Pour créer un projet, cliquez sur :btn:`<fas fa-folder-tree> Projets`. Cela ouvrira l'interface suivante. puis cliquez sur :btn:`<fas fa-pencil-alt> Ajouter` pour créer un nouveau projet. Remplissez simplement le nom et appuyez sur :btn:`<fas fa-check> Appliquez` pour le valider. Le projet nouvellement créé apparaîtra dans la liste.

source: To remove a project, click on the :btn:`<fas fa-trash>` icon next to its name. All the recipes included in the process will be destroyed as well.
fr_fr: Pour supprimer un projet, cliquez sur l'icône :btn:`<fas fa-trash>` à côté de son nom. Toutes les recettes incluses dans le processus seront également détruites.

source: Recipes
fr_fr: Recettes

source: When entering in the process interface by default no projects are selected, meaning that the user will see all the recipes available in its SEPAL account. All recipes are displayed using the following prototype: :code:`<project name> / <recipe name>`.
fr_fr: Lorsque vous entrez dans l'interface de processus, par défaut, aucun projet n'est sélectionné, ce qui signifie que l'utilisateur verra toutes les recettes disponibles dans son compte SEPAL. Toutes les recettes sont affichées en utilisant le prototype suivant : :code:`<project name> / <recipe name>`.

source: From this page the user can customize and manage recipes.
fr_fr: À partir de cette page, l'utilisateur peut personnaliser et gérer les recettes.

source: Filter recipies
fr_fr: Filtrer les recettes

source: click on (3) to filter the recipes according to their project. Once selected, only the recipes included in this project will be displayed. The field is clearable meaning that you can go back to the unfiltered state and select another project. :code:`[no project]` can also be selected.
fr_fr: cliquez sur (3) pour filtrer les recettes selon leur projet. Une fois sélectionnées, seules les recettes incluses dans ce projet seront affichées. Le champ est effaçable, ce qui signifie que vous pouvez retourner à l'état non filtré et sélectionner un autre projet. :code:`[aucun projet]` peut également être sélectionné.

source: Once a project is selected it will appear as "current project" in the project list:
fr_fr: Une fois qu'un projet est sélectionné, il apparaîtra comme "projet actuel" dans la liste des projets:

source: Once a project is selected and a recipe is created, it will belong to the selected project.
fr_fr: Une fois qu'un projet est sélectionné et qu'une recette est créée, il appartiendra au projet sélectionné.

source: If you don't want your recipe to be associated with any project, unfilter the list before clicking on :btn:`<fas fa-plus> Add recipe`.
fr_fr: Si vous ne voulez pas que votre recette soit associée à un projet, dé-filtrez la liste avant de cliquer sur :btn:`<fas fa-plus> Ajouter une recette`.

source: Edit recipies
fr_fr: Éditer des recettes

source: Recipe behavior can be edited directly from this view. Click the :btn:`<fas fa-edit> Edit` button to open the edition interface.
fr_fr: Le comportement de la recette peut être édité directement à partir de cette vue. Cliquez sur le bouton :btn:`<fas fa-edit> Éditez` pour ouvrir l'interface d'édition.

source: from this interface you can:
fr_fr: à partir de cette interface vous pouvez :

source: :btn:`<fas fa-check> Select`: Select/unselect all the recipes shown on screen. Any other edition operation will be only applied on the selected recipe(s).
fr_fr: :btn:`<fas fa-check> Sélectionner`: Sélectionner/désélectionner toutes les recettes affichées à l'écran. Toute autre opération d'édition ne sera appliquée que sur la ou les recettes sélectionnées.

source: :btn:`<fas fa-random> Move`: Move the selected recipe(s) to another project.
fr_fr: :btn:`<fas fa-random> Déplacer`: Déplacer le(s) recette(s) sélectionnée(s) vers un autre projet.

source: :btn:`<fas fa-trash> Remove`: Delete the recipe permanently.
fr_fr: :btn:`<fas fa-trash> Supprimer`: Supprime définitivement la recette.

source: Before deleting individual recipes make sure that they are not used as inputs in others.
fr_fr: Avant de supprimer des recettes individuelles, assurez-vous qu'elles ne sont pas utilisées comme entrées dans d'autres.

source: connect recipes
fr_fr: connecter des recettes

source: When creating recipes, like :code:`Classification` users can use other recipe as input for the process. To avoid flooding the dropdown with to many values only the recipes from the same projet will be displayed (left). If one still want to see all the recipes in the dropdown, click on :btn:`All` and all the recipes will be exposed using project names as headers (right).
fr_fr: Lors de la création de recettes, comme :code:`Classification` les utilisateurs peuvent utiliser une autre recette comme entrée pour le processus. Pour éviter d'inonder le menu déroulant avec de nombreuses valeurs, seules les recettes du même projet seront affichées (à gauche). Si l'on veut toujours voir toutes les recettes dans le menu déroulant, cliquez sur :btn:`Tous` et toutes les recettes seront exposées en utilisant les noms des projets comme en-têtes (à droite).
